OttoDIY/blockly/compilation/arduino/packages/arduino/tools/CMSIS-Atmel/1.2.0/CMSIS/Device/ATMEL/sam4c/include/component/usbfs.h
/* ---------------------------------------------------------------------------- */
/*                  Atmel Microcontroller Software Support                      */
/*                       SAM Software Package License                           */
/* ---------------------------------------------------------------------------- */
/* Copyright (c) 2015, Atmel Corporation                                        */
/*                                                                              */
/* All rights reserved.                                                         */
/*                                                                              */
/* Redistribution and use in source and binary forms, with or without           */
/* modification, are permitted provided that the following condition is met:    */
/*                                                                              */
/* - Redistributions of source code must retain the above copyright notice,     */
/* this list of conditions and the disclaimer below.                            */
/*                                                                              */
/* Atmel's name may not be used to endorse or promote products derived from     */
/* this software without specific prior written permission.                     */
/*                                                                              */
/* DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR   */
/* IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF */
/* MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE   */
/* DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,      */
/* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT */
/* LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,  */
/* OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF    */
/* LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING         */
/* NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, */
/* EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                           */
/* ---------------------------------------------------------------------------- */

#ifndef _SAM4C_USBFS_COMPONENT_
#define _SAM4C_USBFS_COMPONENT_

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR USB Full-Speed Interface */
/* ============================================================================= */
/** \addtogroup SAM4C_USBFS USB Full-Speed Interface */
/*@{*/

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief UsbfsDevdma hardware registers */
typedef struct {
  __IO uint32_t USBFS_DEVDMANXTDSC;  /**< \brief (UsbfsDevdma Offset: 0x0) Device DMA Channel Next Descriptor Address Register */
  __IO uint32_t USBFS_DEVDMAADDRESS; /**< \brief (UsbfsDevdma Offset: 0x4) Device DMA Channel Address Register */
  __IO uint32_t USBFS_DEVDMACONTROL; /**< \brief (UsbfsDevdma Offset: 0x8) Device DMA Channel Control Register */
  __IO uint32_t USBFS_DEVDMASTATUS;  /**< \brief (UsbfsDevdma Offset: 0xC) Device DMA Channel Status Register */
} UsbfsDevdma;
/** \brief UsbfsHstdma hardware registers */
typedef struct {
  __IO uint32_t USBFS_HSTDMANXTDSC;  /**< \brief (UsbfsHstdma Offset: 0x0) Host DMA Channel Next Descriptor Address Register */
  __IO uint32_t USBFS_HSTDMAADDRESS; /**< \brief (UsbfsHstdma Offset: 0x4) Host DMA Channel Address Register */
  __IO uint32_t USBFS_HSTDMACONTROL; /**< \brief (UsbfsHstdma Offset: 0x8) Host DMA Channel Control Register */
  __IO uint32_t USBFS_HSTDMASTATUS;  /**< \brief (UsbfsHstdma Offset: 0xC) Host DMA Channel Status Register */
} UsbfsHstdma;
/** \brief Usbfs hardware registers */
#define USBFSDEVDMA_NUMBER 4
#define USBFSHSTDMA_NUMBER 4
typedef struct {
  __IO uint32_t    USBFS_DEVCTRL;                    /**< \brief (Usbfs Offset: 0x0000) Device General Control Register */
  __I  uint32_t    USBFS_DEVISR;                     /**< \brief (Usbfs Offset: 0x0004) Device Global Interrupt Status Register */
  __O  uint32_t    USBFS_DEVICR;                     /**< \brief (Usbfs Offset: 0x0008) Device Global Interrupt Clear Register */
  __O  uint32_t    USBFS_DEVIFR;                     /**< \brief (Usbfs Offset: 0x000C) Device Global Interrupt Set Register */
  __I  uint32_t    USBFS_DEVIMR;                     /**< \brief (Usbfs Offset: 0x0010) Device Global Interrupt Mask Register */
  __O  uint32_t    USBFS_DEVIDR;                     /**< \brief (Usbfs Offset: 0x0014) Device Global Interrupt Disable Register */
  __O  uint32_t    USBFS_DEVIER;                     /**< \brief (Usbfs Offset: 0x0018) Device Global Interrupt Enable Register */
  __IO uint32_t    USBFS_DEVEPT;                     /**< \brief (Usbfs Offset: 0x001C) Device Endpoint Register */
  __I  uint32_t    USBFS_DEVFNUM;                    /**< \brief (Usbfs Offset: 0x0020) Device Frame Number Register */
  __I  uint32_t    Reserved1[55];
  __IO uint32_t    USBFS_DEVEPTCFG[5];               /**< \brief (Usbfs Offset: 0x100) Device Endpoint Configuration Register (n = 0) */
  __I  uint32_t    Reserved2[7];
  __I  uint32_t    USBFS_DEVEPTISR[5];               /**< \brief (Usbfs Offset: 0x130) Device Endpoint Status Register (n = 0) */
  __I  uint32_t    Reserved3[7];
  __O  uint32_t    USBFS_DEVEPTICR[5];               /**< \brief (Usbfs Offset: 0x160) Device Endpoint Clear Register (n = 0) */
  __I  uint32_t    Reserved4[7];
  __O  uint32_t    USBFS_DEVEPTIFR[5];               /**< \brief (Usbfs Offset: 0x190) Device Endpoint Set Register (n = 0) */
  __I  uint32_t    Reserved5[7];
  __I  uint32_t    USBFS_DEVEPTIMR[5];               /**< \brief (Usbfs Offset: 0x1C0) Device Endpoint Mask Register (n = 0) */
  __I  uint32_t    Reserved6[7];
  __O  uint32_t    USBFS_DEVEPTIER[5];               /**< \brief (Usbfs Offset: 0x1F0) Device Endpoint Enable Register (n = 0) */
  __I  uint32_t    Reserved7[7];
  __O  uint32_t    USBFS_DEVEPTIDR[5];               /**< \brief (Usbfs Offset: 0x220) Device Endpoint Disable Register (n = 0) */
  __I  uint32_t    Reserved8[55];
       UsbfsDevdma USBFS_DEVDMA[USBFSDEVDMA_NUMBER]; /**< \brief (Usbfs Offset: 0x310) n = 1 .. 4 */
  __I  uint32_t    Reserved9[44];
  __IO uint32_t    USBFS_HSTCTRL;                    /**< \brief (Usbfs Offset: 0x0400) Host General Control Register */
  __I  uint32_t    USBFS_HSTISR;                     /**< \brief (Usbfs Offset: 0x0404) Host Global Interrupt Status Register */
  __O  uint32_t    USBFS_HSTICR;                     /**< \brief (Usbfs Offset: 0x0408) Host Global Interrupt Clear Register */
  __O  uint32_t    USBFS_HSTIFR;                     /**< \brief (Usbfs Offset: 0x040C) Host Global Interrupt Set Register */
  __I  uint32_t    USBFS_HSTIMR;                     /**< \brief (Usbfs Offset: 0x0410) Host Global Interrupt Mask Register */
  __O  uint32_t    USBFS_HSTIDR;                     /**< \brief (Usbfs Offset: 0x0414) Host Global Interrupt Disable Register */
  __O  uint32_t    USBFS_HSTIER;                     /**< \brief (Usbfs Offset: 0x0418) Host Global Interrupt Enable Register */
  __IO uint32_t    USBFS_HSTPIP;                     /**< \brief (Usbfs Offset: 0x0041C) Host Pipe Register */
  __IO uint32_t    USBFS_HSTFNUM;                    /**< \brief (Usbfs Offset: 0x0420) Host Frame Number Register */
  __IO uint32_t    USBFS_HSTADDR1;                   /**< \brief (Usbfs Offset: 0x0424) Host Address 1 Register */
  __IO uint32_t    USBFS_HSTADDR2;                   /**< \brief (Usbfs Offset: 0x0428) Host Address 2 Register */
  __IO uint32_t    USBFS_HSTADDR3;                   /**< \brief (Usbfs Offset: 0x042C) Host Address 3 Register */
  __I  uint32_t    Reserved10[52];
  __IO uint32_t    USBFS_HSTPIPCFG[5];               /**< \brief (Usbfs Offset: 0x500) Host Pipe Configuration Register (n = 0) */
  __I  uint32_t    Reserved11[7];
  __I  uint32_t    USBFS_HSTPIPISR[5];               /**< \brief (Usbfs Offset: 0x530) Host Pipe Status Register (n = 0) */
  __I  uint32_t    Reserved12[7];
  __O  uint32_t    USBFS_HSTPIPICR[5];               /**< \brief (Usbfs Offset: 0x560) Host Pipe Clear Register (n = 0) */
  __I  uint32_t    Reserved13[7];
  __O  uint32_t    USBFS_HSTPIPIFR[5];               /**< \brief (Usbfs Offset: 0x590) Host Pipe Set Register (n = 0) */
  __I  uint32_t    Reserved14[7];
  __I  uint32_t    USBFS_HSTPIPIMR[5];               /**< \brief (Usbfs Offset: 0x5C0) Host Pipe Mask Register (n = 0) */
  __I  uint32_t    Reserved15[7];
  __O  uint32_t    USBFS_HSTPIPIER[5];               /**< \brief (Usbfs Offset: 0x5F0) Host Pipe Enable Register (n = 0) */
  __I  uint32_t    Reserved16[7];
  __O  uint32_t    USBFS_HSTPIPIDR[5];               /**< \brief (Usbfs Offset: 0x620) Host Pipe Disable Register (n = 0) */
  __I  uint32_t    Reserved17[7];
  __IO uint32_t    USBFS_HSTPIPINRQ[5];              /**< \brief (Usbfs Offset: 0x650) Host Pipe IN Request Register (n = 0) */
  __I  uint32_t    Reserved18[7];
  __IO uint32_t    USBFS_HSTPIPERR[5];               /**< \brief (Usbfs Offset: 0x680) Host Pipe Error Register (n = 0) */
  __I  uint32_t    Reserved19[31];
       UsbfsHstdma USBFS_HSTDMA[USBFSHSTDMA_NUMBER]; /**< \brief (Usbfs Offset: 0x710) n = 1 .. 4 */
  __I  uint32_t    Reserved20[44];
  __IO uint32_t    USBFS_CTRL;                       /**< \brief (Usbfs Offset: 0x0800) General Control Register */
  __I  uint32_t    USBFS_SR;                         /**< \brief (Usbfs Offset: 0x0804) General Status Register */
  __O  uint32_t    USBFS_SCR;                        /**< \brief (Usbfs Offset: 0x0808) General Status Clear Register */
  __O  uint32_t    USBFS_SFR;                        /**< \brief (Usbfs Offset: 0x080C) General Status Set Register */
} Usbfs;
