OttoDIY/blockly/compilation/arduino/packages/arduino/tools/CMSIS-Atmel/1.2.0/CMSIS/Device/ATMEL/sam4c/include/component/usbfs.h
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */
/* -------- USBFS_DEVCTRL : (USBFS Offset: 0x0000) Device General Control Register -------- */
#define USBFS_DEVCTRL_UADD_Pos 0
#define USBFS_DEVCTRL_UADD_Msk (0x7fu << USBFS_DEVCTRL_UADD_Pos) /**< \brief (USBFS_DEVCTRL) USB Address */
#define USBFS_DEVCTRL_UADD(value) ((USBFS_DEVCTRL_UADD_Msk & ((value) << USBFS_DEVCTRL_UADD_Pos)))
#define USBFS_DEVCTRL_ADDEN (0x1u << 7) /**< \brief (USBFS_DEVCTRL) Address Enable */
#define USBFS_DEVCTRL_DETACH (0x1u << 8) /**< \brief (USBFS_DEVCTRL) Detach */
#define USBFS_DEVCTRL_RMWKUP (0x1u << 9) /**< \brief (USBFS_DEVCTRL) Remote Wake-Up */
/* -------- USBFS_DEVISR : (USBFS Offset: 0x0004) Device Global Interrupt Status Register -------- */
#define USBFS_DEVISR_SUSP (0x1u << 0) /**< \brief (USBFS_DEVISR) Suspend Interrupt */
#define USBFS_DEVISR_SOF (0x1u << 2) /**< \brief (USBFS_DEVISR) Start of Frame Interrupt */
#define USBFS_DEVISR_EORST (0x1u << 3) /**< \brief (USBFS_DEVISR) End of Reset Interrupt */
#define USBFS_DEVISR_WAKEUP (0x1u << 4) /**< \brief (USBFS_DEVISR) Wake-Up Interrupt */
#define USBFS_DEVISR_EORSM (0x1u << 5) /**< \brief (USBFS_DEVISR) End of Resume Interrupt */
#define USBFS_DEVISR_UPRSM (0x1u << 6) /**< \brief (USBFS_DEVISR) Upstream Resume Interrupt */
#define USBFS_DEVISR_PEP_0 (0x1u << 12) /**< \brief (USBFS_DEVISR) Endpoint 0 Interrupt */
#define USBFS_DEVISR_PEP_1 (0x1u << 13) /**< \brief (USBFS_DEVISR) Endpoint 1 Interrupt */
#define USBFS_DEVISR_PEP_2 (0x1u << 14) /**< \brief (USBFS_DEVISR) Endpoint 2 Interrupt */
#define USBFS_DEVISR_PEP_3 (0x1u << 15) /**< \brief (USBFS_DEVISR) Endpoint 3 Interrupt */
#define USBFS_DEVISR_PEP_4 (0x1u << 16) /**< \brief (USBFS_DEVISR) Endpoint 4 Interrupt */
#define USBFS_DEVISR_DMA_1 (0x1u << 25) /**< \brief (USBFS_DEVISR) DMA Channel 1 Interrupt */
#define USBFS_DEVISR_DMA_2 (0x1u << 26) /**< \brief (USBFS_DEVISR) DMA Channel 2 Interrupt */
#define USBFS_DEVISR_DMA_3 (0x1u << 27) /**< \brief (USBFS_DEVISR) DMA Channel 3 Interrupt */
#define USBFS_DEVISR_DMA_4 (0x1u << 28) /**< \brief (USBFS_DEVISR) DMA Channel 4 Interrupt */
/* -------- USBFS_DEVICR : (USBFS Offset: 0x0008) Device Global Interrupt Clear Register -------- */
#define USBFS_DEVICR_SUSPC (0x1u << 0) /**< \brief (USBFS_DEVICR) Suspend Interrupt Clear */
#define USBFS_DEVICR_SOFC (0x1u << 2) /**< \brief (USBFS_DEVICR) Start of Frame Interrupt Clear */
#define USBFS_DEVICR_EORSTC (0x1u << 3) /**< \brief (USBFS_DEVICR) End of Reset Interrupt Clear */
#define USBFS_DEVICR_WAKEUPC (0x1u << 4) /**< \brief (USBFS_DEVICR) Wake-Up Interrupt Clear */
#define USBFS_DEVICR_EORSMC (0x1u << 5) /**< \brief (USBFS_DEVICR) End of Resume Interrupt Clear */
#define USBFS_DEVICR_UPRSMC (0x1u << 6) /**< \brief (USBFS_DEVICR) Upstream Resume Interrupt Clear */
/* -------- USBFS_DEVIFR : (USBFS Offset: 0x000C) Device Global Interrupt Set Register -------- */
#define USBFS_DEVIFR_SUSPS (0x1u << 0) /**< \brief (USBFS_DEVIFR) Suspend Interrupt Set */
#define USBFS_DEVIFR_SOFS (0x1u << 2) /**< \brief (USBFS_DEVIFR) Start of Frame Interrupt Set */
#define USBFS_DEVIFR_EORSTS (0x1u << 3) /**< \brief (USBFS_DEVIFR) End of Reset Interrupt Set */
#define USBFS_DEVIFR_WAKEUPS (0x1u << 4) /**< \brief (USBFS_DEVIFR) Wake-Up Interrupt Set */
#define USBFS_DEVIFR_EORSMS (0x1u << 5) /**< \brief (USBFS_DEVIFR) End of Resume Interrupt Set */
#define USBFS_DEVIFR_UPRSMS (0x1u << 6) /**< \brief (USBFS_DEVIFR) Upstream Resume Interrupt Set */
#define USBFS_DEVIFR_DMA_1 (0x1u << 25) /**< \brief (USBFS_DEVIFR) DMA Channel 1 Interrupt Set */
#define USBFS_DEVIFR_DMA_2 (0x1u << 26) /**< \brief (USBFS_DEVIFR) DMA Channel 2 Interrupt Set */
#define USBFS_DEVIFR_DMA_3 (0x1u << 27) /**< \brief (USBFS_DEVIFR) DMA Channel 3 Interrupt Set */
#define USBFS_DEVIFR_DMA_4 (0x1u << 28) /**< \brief (USBFS_DEVIFR) DMA Channel 4 Interrupt Set */
/* -------- USBFS_DEVIMR : (USBFS Offset: 0x0010) Device Global Interrupt Mask Register -------- */
#define USBFS_DEVIMR_SUSPE (0x1u << 0) /**< \brief (USBFS_DEVIMR) Suspend Interrupt Mask */
#define USBFS_DEVIMR_SOFE (0x1u << 2) /**< \brief (USBFS_DEVIMR) Start of Frame Interrupt Mask */
#define USBFS_DEVIMR_EORSTE (0x1u << 3) /**< \brief (USBFS_DEVIMR) End of Reset Interrupt Mask */
#define USBFS_DEVIMR_WAKEUPE (0x1u << 4) /**< \brief (USBFS_DEVIMR) Wake-Up Interrupt Mask */
#define USBFS_DEVIMR_EORSME (0x1u << 5) /**< \brief (USBFS_DEVIMR) End of Resume Interrupt Mask */
#define USBFS_DEVIMR_UPRSME (0x1u << 6) /**< \brief (USBFS_DEVIMR) Upstream Resume Interrupt Mask */
#define USBFS_DEVIMR_PEP_0 (0x1u << 12) /**< \brief (USBFS_DEVIMR) Endpoint 0 Interrupt Mask */
#define USBFS_DEVIMR_PEP_1 (0x1u << 13) /**< \brief (USBFS_DEVIMR) Endpoint 1 Interrupt Mask */
#define USBFS_DEVIMR_PEP_2 (0x1u << 14) /**< \brief (USBFS_DEVIMR) Endpoint 2 Interrupt Mask */
#define USBFS_DEVIMR_PEP_3 (0x1u << 15) /**< \brief (USBFS_DEVIMR) Endpoint 3 Interrupt Mask */
#define USBFS_DEVIMR_PEP_4 (0x1u << 16) /**< \brief (USBFS_DEVIMR) Endpoint 4 Interrupt Mask */
#define USBFS_DEVIMR_DMA_1 (0x1u << 25) /**< \brief (USBFS_DEVIMR) DMA Channel 1 Interrupt Mask */
#define USBFS_DEVIMR_DMA_2 (0x1u << 26) /**< \brief (USBFS_DEVIMR) DMA Channel 2 Interrupt Mask */
#define USBFS_DEVIMR_DMA_3 (0x1u << 27) /**< \brief (USBFS_DEVIMR) DMA Channel 3 Interrupt Mask */
#define USBFS_DEVIMR_DMA_4 (0x1u << 28) /**< \brief (USBFS_DEVIMR) DMA Channel 4 Interrupt Mask */
/* -------- USBFS_DEVIDR : (USBFS Offset: 0x0014) Device Global Interrupt Disable Register -------- */
#define USBFS_DEVIDR_SUSPEC (0x1u << 0) /**< \brief (USBFS_DEVIDR) Suspend Interrupt Disable */
#define USBFS_DEVIDR_SOFEC (0x1u << 2) /**< \brief (USBFS_DEVIDR) Start of Frame Interrupt Disable */
#define USBFS_DEVIDR_EORSTEC (0x1u << 3) /**< \brief (USBFS_DEVIDR) End of Reset Interrupt Disable */
#define USBFS_DEVIDR_WAKEUPEC (0x1u << 4) /**< \brief (USBFS_DEVIDR) Wake-Up Interrupt Disable */
#define USBFS_DEVIDR_EORSMEC (0x1u << 5) /**< \brief (USBFS_DEVIDR) End of Resume Interrupt Disable */
#define USBFS_DEVIDR_UPRSMEC (0x1u << 6) /**< \brief (USBFS_DEVIDR) Upstream Resume Interrupt Disable */
#define USBFS_DEVIDR_PEP_0 (0x1u << 12) /**< \brief (USBFS_DEVIDR) Endpoint 0 Interrupt Disable */
#define USBFS_DEVIDR_PEP_1 (0x1u << 13) /**< \brief (USBFS_DEVIDR) Endpoint 1 Interrupt Disable */
#define USBFS_DEVIDR_PEP_2 (0x1u << 14) /**< \brief (USBFS_DEVIDR) Endpoint 2 Interrupt Disable */
#define USBFS_DEVIDR_PEP_3 (0x1u << 15) /**< \brief (USBFS_DEVIDR) Endpoint 3 Interrupt Disable */
#define USBFS_DEVIDR_PEP_4 (0x1u << 16) /**< \brief (USBFS_DEVIDR) Endpoint 4 Interrupt Disable */
#define USBFS_DEVIDR_DMA_1 (0x1u << 25) /**< \brief (USBFS_DEVIDR) DMA Channel 1 Interrupt Disable */
#define USBFS_DEVIDR_DMA_2 (0x1u << 26) /**< \brief (USBFS_DEVIDR) DMA Channel 2 Interrupt Disable */
#define USBFS_DEVIDR_DMA_3 (0x1u << 27) /**< \brief (USBFS_DEVIDR) DMA Channel 3 Interrupt Disable */
#define USBFS_DEVIDR_DMA_4 (0x1u << 28) /**< \brief (USBFS_DEVIDR) DMA Channel 4 Interrupt Disable */
/* -------- USBFS_DEVIER : (USBFS Offset: 0x0018) Device Global Interrupt Enable Register -------- */
#define USBFS_DEVIER_SUSPES (0x1u << 0) /**< \brief (USBFS_DEVIER) Suspend Interrupt Enable */
#define USBFS_DEVIER_SOFES (0x1u << 2) /**< \brief (USBFS_DEVIER) Start of Frame Interrupt Enable */
#define USBFS_DEVIER_EORSTES (0x1u << 3) /**< \brief (USBFS_DEVIER) End of Reset Interrupt Enable */
#define USBFS_DEVIER_WAKEUPES (0x1u << 4) /**< \brief (USBFS_DEVIER) Wake-Up Interrupt Enable */
#define USBFS_DEVIER_EORSMES (0x1u << 5) /**< \brief (USBFS_DEVIER) End of Resume Interrupt Enable */
#define USBFS_DEVIER_UPRSMES (0x1u << 6) /**< \brief (USBFS_DEVIER) Upstream Resume Interrupt Enable */
#define USBFS_DEVIER_PEP_0 (0x1u << 12) /**< \brief (USBFS_DEVIER) Endpoint 0 Interrupt Enable */
#define USBFS_DEVIER_PEP_1 (0x1u << 13) /**< \brief (USBFS_DEVIER) Endpoint 1 Interrupt Enable */
#define USBFS_DEVIER_PEP_2 (0x1u << 14) /**< \brief (USBFS_DEVIER) Endpoint 2 Interrupt Enable */
#define USBFS_DEVIER_PEP_3 (0x1u << 15) /**< \brief (USBFS_DEVIER) Endpoint 3 Interrupt Enable */
#define USBFS_DEVIER_PEP_4 (0x1u << 16) /**< \brief (USBFS_DEVIER) Endpoint 4 Interrupt Enable */
#define USBFS_DEVIER_DMA_1 (0x1u << 25) /**< \brief (USBFS_DEVIER) DMA Channel 1 Interrupt Enable */
#define USBFS_DEVIER_DMA_2 (0x1u << 26) /**< \brief (USBFS_DEVIER) DMA Channel 2 Interrupt Enable */
#define USBFS_DEVIER_DMA_3 (0x1u << 27) /**< \brief (USBFS_DEVIER) DMA Channel 3 Interrupt Enable */
#define USBFS_DEVIER_DMA_4 (0x1u << 28) /**< \brief (USBFS_DEVIER) DMA Channel 4 Interrupt Enable */
/* -------- USBFS_DEVEPT : (USBFS Offset: 0x001C) Device Endpoint Register -------- */
#define USBFS_DEVEPT_EPEN0 (0x1u << 0) /**< \brief (USBFS_DEVEPT) Endpoint 0 Enable */
#define USBFS_DEVEPT_EPEN1 (0x1u << 1) /**< \brief (USBFS_DEVEPT) Endpoint 1 Enable */
#define USBFS_DEVEPT_EPEN2 (0x1u << 2) /**< \brief (USBFS_DEVEPT) Endpoint 2 Enable */
#define USBFS_DEVEPT_EPEN3 (0x1u << 3) /**< \brief (USBFS_DEVEPT) Endpoint 3 Enable */
#define USBFS_DEVEPT_EPEN4 (0x1u << 4) /**< \brief (USBFS_DEVEPT) Endpoint 4 Enable */
#define USBFS_DEVEPT_EPEN5 (0x1u << 5) /**< \brief (USBFS_DEVEPT) Endpoint 5 Enable */
#define USBFS_DEVEPT_EPEN6 (0x1u << 6) /**< \brief (USBFS_DEVEPT) Endpoint 6 Enable */
#define USBFS_DEVEPT_EPEN7 (0x1u << 7) /**< \brief (USBFS_DEVEPT) Endpoint 7 Enable */
#define USBFS_DEVEPT_EPEN8 (0x1u << 8) /**< \brief (USBFS_DEVEPT) Endpoint 8 Enable */
#define USBFS_DEVEPT_EPRST0 (0x1u << 16) /**< \brief (USBFS_DEVEPT) Endpoint 0 Reset */
#define USBFS_DEVEPT_EPRST1 (0x1u << 17) /**< \brief (USBFS_DEVEPT) Endpoint 1 Reset */
#define USBFS_DEVEPT_EPRST2 (0x1u << 18) /**< \brief (USBFS_DEVEPT) Endpoint 2 Reset */
#define USBFS_DEVEPT_EPRST3 (0x1u << 19) /**< \brief (USBFS_DEVEPT) Endpoint 3 Reset */
#define USBFS_DEVEPT_EPRST4 (0x1u << 20) /**< \brief (USBFS_DEVEPT) Endpoint 4 Reset */
#define USBFS_DEVEPT_EPRST5 (0x1u << 21) /**< \brief (USBFS_DEVEPT) Endpoint 5 Reset */
#define USBFS_DEVEPT_EPRST6 (0x1u << 22) /**< \brief (USBFS_DEVEPT) Endpoint 6 Reset */
#define USBFS_DEVEPT_EPRST7 (0x1u << 23) /**< \brief (USBFS_DEVEPT) Endpoint 7 Reset */
#define USBFS_DEVEPT_EPRST8 (0x1u << 24) /**< \brief (USBFS_DEVEPT) Endpoint 8 Reset */
/* -------- USBFS_DEVFNUM : (USBFS Offset: 0x0020) Device Frame Number Register -------- */
#define USBFS_DEVFNUM_FNUM_Pos 3
#define USBFS_DEVFNUM_FNUM_Msk (0x7ffu << USBFS_DEVFNUM_FNUM_Pos) /**< \brief (USBFS_DEVFNUM) Frame Number */
#define USBFS_DEVFNUM_FNCERR (0x1u << 15) /**< \brief (USBFS_DEVFNUM) Frame Number CRC Error */
/* -------- USBFS_DEVEPTCFG[5] : (USBFS Offset: 0x100) Device Endpoint Configuration Register (n = 0) -------- */
#define USBFS_DEVEPTCFG_ALLOC (0x1u << 1) /**< \brief (USBFS_DEVEPTCFG[5]) Endpoint Memory Allocate */
#define USBFS_DEVEPTCFG_EPBK_Pos 2
#define USBFS_DEVEPTCFG_EPBK_Msk (0x3u << USBFS_DEVEPTCFG_EPBK_Pos) /**< \brief (USBFS_DEVEPTCFG[5]) Endpoint Banks */
#define USBFS_DEVEPTCFG_EPBK(value) ((USBFS_DEVEPTCFG_EPBK_Msk & ((value) << USBFS_DEVEPTCFG_EPBK_Pos)))
#define   USBFS_DEVEPTCFG_EPBK_1_BANK (0x0u << 2) /**< \brief (USBFS_DEVEPTCFG[5]) Single-bank endpoint */
#define   USBFS_DEVEPTCFG_EPBK_2_BANK (0x1u << 2) /**< \brief (USBFS_DEVEPTCFG[5]) Double-bank endpoint */
#define   USBFS_DEVEPTCFG_EPBK_3_BANK (0x2u << 2) /**< \brief (USBFS_DEVEPTCFG[5]) Triple-bank endpoint */
#define USBFS_DEVEPTCFG_EPSIZE_Pos 4
#define USBFS_DEVEPTCFG_EPSIZE_Msk (0x7u << USBFS_DEVEPTCFG_EPSIZE_Pos) /**< \brief (USBFS_DEVEPTCFG[5]) Endpoint Size */
#define USBFS_DEVEPTCFG_EPSIZE(value) ((USBFS_DEVEPTCFG_EPSIZE_Msk & ((value) << USBFS_DEVEPTCFG_EPSIZE_Pos)))
#define   USBFS_DEVEPTCFG_EPSIZE_8_BYTE (0x0u << 4) /**< \brief (USBFS_DEVEPTCFG[5]) 8 bytes */
#define   USBFS_DEVEPTCFG_EPSIZE_16_BYTE (0x1u << 4) /**< \brief (USBFS_DEVEPTCFG[5]) 16 bytes */
#define   USBFS_DEVEPTCFG_EPSIZE_32_BYTE (0x2u << 4) /**< \brief (USBFS_DEVEPTCFG[5]) 32 bytes */
#define   USBFS_DEVEPTCFG_EPSIZE_64_BYTE (0x3u << 4) /**< \brief (USBFS_DEVEPTCFG[5]) 64 bytes */
#define   USBFS_DEVEPTCFG_EPSIZE_128_BYTE (0x4u << 4) /**< \brief (USBFS_DEVEPTCFG[5]) 128 bytes */
#define   USBFS_DEVEPTCFG_EPSIZE_256_BYTE (0x5u << 4) /**< \brief (USBFS_DEVEPTCFG[5]) 256 bytes */
#define   USBFS_DEVEPTCFG_EPSIZE_512_BYTE (0x6u << 4) /**< \brief (USBFS_DEVEPTCFG[5]) 512 bytes */
#define   USBFS_DEVEPTCFG_EPSIZE_1024_BYTE (0x7u << 4) /**< \brief (USBFS_DEVEPTCFG[5]) 1024 bytes */
#define USBFS_DEVEPTCFG_EPDIR (0x1u << 8) /**< \brief (USBFS_DEVEPTCFG[5]) Endpoint Direction */
#define   USBFS_DEVEPTCFG_EPDIR_OUT (0x0u << 8) /**< \brief (USBFS_DEVEPTCFG[5]) The endpoint direction is OUT. */
#define   USBFS_DEVEPTCFG_EPDIR_IN (0x1u << 8) /**< \brief (USBFS_DEVEPTCFG[5]) The endpoint direction is IN (nor for control endpoints). */
#define USBFS_DEVEPTCFG_AUTOSW (0x1u << 9) /**< \brief (USBFS_DEVEPTCFG[5]) Automatic Switch */
#define USBFS_DEVEPTCFG_EPTYPE_Pos 11
#define USBFS_DEVEPTCFG_EPTYPE_Msk (0x3u << USBFS_DEVEPTCFG_EPTYPE_Pos) /**< \brief (USBFS_DEVEPTCFG[5]) Endpoint Type */
#define USBFS_DEVEPTCFG_EPTYPE(value) ((USBFS_DEVEPTCFG_EPTYPE_Msk & ((value) << USBFS_DEVEPTCFG_EPTYPE_Pos)))
#define   USBFS_DEVEPTCFG_EPTYPE_CTRL (0x0u << 11) /**< \brief (USBFS_DEVEPTCFG[5]) Control */
#define   USBFS_DEVEPTCFG_EPTYPE_ISO (0x1u << 11) /**< \brief (USBFS_DEVEPTCFG[5]) Isochronous */
#define   USBFS_DEVEPTCFG_EPTYPE_BLK (0x2u << 11) /**< \brief (USBFS_DEVEPTCFG[5]) Bulk */
#define   USBFS_DEVEPTCFG_EPTYPE_INTRPT (0x3u << 11) /**< \brief (USBFS_DEVEPTCFG[5]) Interrupt */
/* -------- USBFS_DEVEPTISR[5] : (USBFS Offset: 0x130) Device Endpoint Status Register (n = 0) -------- */
#define USBFS_DEVEPTISR_TXINI (0x1u << 0) /**< \brief (USBFS_DEVEPTISR[5]) Transmitted IN Data Interrupt */
#define USBFS_DEVEPTISR_RXOUTI (0x1u << 1) /**< \brief (USBFS_DEVEPTISR[5]) Received OUT Data Interrupt */
#define USBFS_DEVEPTISR_RXSTPI (0x1u << 2) /**< \brief (USBFS_DEVEPTISR[5]) Received SETUP Interrupt */
#define USBFS_DEVEPTISR_NAKOUTI (0x1u << 3) /**< \brief (USBFS_DEVEPTISR[5]) NAKed OUT Interrupt */
#define USBFS_DEVEPTISR_NAKINI (0x1u << 4) /**< \brief (USBFS_DEVEPTISR[5]) NAKed IN Interrupt */
#define USBFS_DEVEPTISR_OVERFI (0x1u << 5) /**< \brief (USBFS_DEVEPTISR[5]) Overflow Interrupt */
#define USBFS_DEVEPTISR_STALLEDI (0x1u << 6) /**< \brief (USBFS_DEVEPTISR[5]) STALLed Interrupt */
#define USBFS_DEVEPTISR_SHORTPACKET (0x1u << 7) /**< \brief (USBFS_DEVEPTISR[5]) Short Packet Interrupt */
#define USBFS_DEVEPTISR_DTSEQ_Pos 8
#define USBFS_DEVEPTISR_DTSEQ_Msk (0x3u << USBFS_DEVEPTISR_DTSEQ_Pos) /**< \brief (USBFS_DEVEPTISR[5]) Data Toggle Sequence */
#define   USBFS_DEVEPTISR_DTSEQ_DATA0 (0x0u << 8) /**< \brief (USBFS_DEVEPTISR[5]) Data0 toggle sequence */
#define   USBFS_DEVEPTISR_DTSEQ_DATA1 (0x1u << 8) /**< \brief (USBFS_DEVEPTISR[5]) Data1 toggle sequence */
#define USBFS_DEVEPTISR_NBUSYBK_Pos 12
#define USBFS_DEVEPTISR_NBUSYBK_Msk (0x3u << USBFS_DEVEPTISR_NBUSYBK_Pos) /**< \brief (USBFS_DEVEPTISR[5]) Number of Busy Banks */
#define   USBFS_DEVEPTISR_NBUSYBK_0_BUSY (0x0u << 12) /**< \brief (USBFS_DEVEPTISR[5]) 0 busy bank (all banks free) */
#define   USBFS_DEVEPTISR_NBUSYBK_1_BUSY (0x1u << 12) /**< \brief (USBFS_DEVEPTISR[5]) 1 busy bank */
#define   USBFS_DEVEPTISR_NBUSYBK_2_BUSY (0x2u << 12) /**< \brief (USBFS_DEVEPTISR[5]) 2 busy banks */
#define   USBFS_DEVEPTISR_NBUSYBK_3_BUSY (0x3u << 12) /**< \brief (USBFS_DEVEPTISR[5]) 3 busy banks */
#define USBFS_DEVEPTISR_CURRBK_Pos 14
#define USBFS_DEVEPTISR_CURRBK_Msk (0x3u << USBFS_DEVEPTISR_CURRBK_Pos) /**< \brief (USBFS_DEVEPTISR[5]) Current Bank */
#define   USBFS_DEVEPTISR_CURRBK_BANK0 (0x0u << 14) /**< \brief (USBFS_DEVEPTISR[5]) Current bank is bank0 */
#define   USBFS_DEVEPTISR_CURRBK_BANK1 (0x1u << 14) /**< \brief (USBFS_DEVEPTISR[5]) Current bank is bank1 */
#define   USBFS_DEVEPTISR_CURRBK_BANK2 (0x2u << 14) /**< \brief (USBFS_DEVEPTISR[5]) Current bank is bank2 */
#define USBFS_DEVEPTISR_RWALL (0x1u << 16) /**< \brief (USBFS_DEVEPTISR[5]) Read/Write Allowed */
#define USBFS_DEVEPTISR_CTRLDIR (0x1u << 17) /**< \brief (USBFS_DEVEPTISR[5]) Control Direction */
#define USBFS_DEVEPTISR_CFGOK (0x1u << 18) /**< \brief (USBFS_DEVEPTISR[5]) Configuration OK Status */
#define USBFS_DEVEPTISR_BYCT_Pos 20
#define USBFS_DEVEPTISR_BYCT_Msk (0x7ffu << USBFS_DEVEPTISR_BYCT_Pos) /**< \brief (USBFS_DEVEPTISR[5]) Byte Count */
#define USBFS_DEVEPTISR_UNDERFI (0x1u << 2) /**< \brief (USBFS_DEVEPTISR[5]) Underflow Interrupt */
#define USBFS_DEVEPTISR_CRCERRI (0x1u << 6) /**< \brief (USBFS_DEVEPTISR[5]) CRC Error Interrupt */
/* -------- USBFS_DEVEPTICR[5] : (USBFS Offset: 0x160) Device Endpoint Clear Register (n = 0) -------- */
#define USBFS_DEVEPTICR_TXINIC (0x1u << 0) /**< \brief (USBFS_DEVEPTICR[5]) Transmitted IN Data Interrupt Clear */
#define USBFS_DEVEPTICR_RXOUTIC (0x1u << 1) /**< \brief (USBFS_DEVEPTICR[5]) Received OUT Data Interrupt Clear */
#define USBFS_DEVEPTICR_RXSTPIC (0x1u << 2) /**< \brief (USBFS_DEVEPTICR[5]) Received SETUP Interrupt Clear */
#define USBFS_DEVEPTICR_NAKOUTIC (0x1u << 3) /**< \brief (USBFS_DEVEPTICR[5]) NAKed OUT Interrupt Clear */
#define USBFS_DEVEPTICR_NAKINIC (0x1u << 4) /**< \brief (USBFS_DEVEPTICR[5]) NAKed IN Interrupt Clear */
#define USBFS_DEVEPTICR_OVERFIC (0x1u << 5) /**< \brief (USBFS_DEVEPTICR[5]) Overflow Interrupt Clear */
#define USBFS_DEVEPTICR_STALLEDIC (0x1u << 6) /**< \brief (USBFS_DEVEPTICR[5]) STALLed Interrupt Clear */
#define USBFS_DEVEPTICR_SHORTPACKETC (0x1u << 7) /**< \brief (USBFS_DEVEPTICR[5]) Short Packet Interrupt Clear */
#define USBFS_DEVEPTICR_UNDERFIC (0x1u << 2) /**< \brief (USBFS_DEVEPTICR[5]) Underflow Interrupt Clear */
#define USBFS_DEVEPTICR_CRCERRIC (0x1u << 6) /**< \brief (USBFS_DEVEPTICR[5]) CRC Error Interrupt Clear */
/* -------- USBFS_DEVEPTIFR[5] : (USBFS Offset: 0x190) Device Endpoint Set Register (n = 0) -------- */
#define USBFS_DEVEPTIFR_TXINIS (0x1u << 0) /**< \brief (USBFS_DEVEPTIFR[5]) Transmitted IN Data Interrupt Set */
#define USBFS_DEVEPTIFR_RXOUTIS (0x1u << 1) /**< \brief (USBFS_DEVEPTIFR[5]) Received OUT Data Interrupt Set */
#define USBFS_DEVEPTIFR_RXSTPIS (0x1u << 2) /**< \brief (USBFS_DEVEPTIFR[5]) Received SETUP Interrupt Set */
#define USBFS_DEVEPTIFR_NAKOUTIS (0x1u << 3) /**< \brief (USBFS_DEVEPTIFR[5]) NAKed OUT Interrupt Set */
#define USBFS_DEVEPTIFR_NAKINIS (0x1u << 4) /**< \brief (USBFS_DEVEPTIFR[5]) NAKed IN Interrupt Set */
#define USBFS_DEVEPTIFR_OVERFIS (0x1u << 5) /**< \brief (USBFS_DEVEPTIFR[5]) Overflow Interrupt Set */
#define USBFS_DEVEPTIFR_STALLEDIS (0x1u << 6) /**< \brief (USBFS_DEVEPTIFR[5]) STALLed Interrupt Set */
#define USBFS_DEVEPTIFR_SHORTPACKETS (0x1u << 7) /**< \brief (USBFS_DEVEPTIFR[5]) Short Packet Interrupt Set */
#define USBFS_DEVEPTIFR_NBUSYBKS (0x1u << 12) /**< \brief (USBFS_DEVEPTIFR[5]) Number of Busy Banks Interrupt Set */
#define USBFS_DEVEPTIFR_UNDERFIS (0x1u << 2) /**< \brief (USBFS_DEVEPTIFR[5]) Underflow Interrupt Set */
#define USBFS_DEVEPTIFR_CRCERRIS (0x1u << 6) /**< \brief (USBFS_DEVEPTIFR[5]) CRC Error Interrupt Set */
/* -------- USBFS_DEVEPTIMR[5] : (USBFS Offset: 0x1C0) Device Endpoint Mask Register (n = 0) -------- */
#define USBFS_DEVEPTIMR_TXINE (0x1u << 0) /**< \brief (USBFS_DEVEPTIMR[5]) Transmitted IN Data Interrupt */
#define USBFS_DEVEPTIMR_RXOUTE (0x1u << 1) /**< \brief (USBFS_DEVEPTIMR[5]) Received OUT Data Interrupt */
#define USBFS_DEVEPTIMR_RXSTPE (0x1u << 2) /**< \brief (USBFS_DEVEPTIMR[5]) Received SETUP Interrupt */
#define USBFS_DEVEPTIMR_NAKOUTE (0x1u << 3) /**< \brief (USBFS_DEVEPTIMR[5]) NAKed OUT Interrupt */
#define USBFS_DEVEPTIMR_NAKINE (0x1u << 4) /**< \brief (USBFS_DEVEPTIMR[5]) NAKed IN Interrupt */
#define USBFS_DEVEPTIMR_OVERFE (0x1u << 5) /**< \brief (USBFS_DEVEPTIMR[5]) Overflow Interrupt */
#define USBFS_DEVEPTIMR_STALLEDE (0x1u << 6) /**< \brief (USBFS_DEVEPTIMR[5]) STALLed Interrupt */
#define USBFS_DEVEPTIMR_SHORTPACKETE (0x1u << 7) /**< \brief (USBFS_DEVEPTIMR[5]) Short Packet Interrupt */
#define USBFS_DEVEPTIMR_NBUSYBKE (0x1u << 12) /**< \brief (USBFS_DEVEPTIMR[5]) Number of Busy Banks Interrupt */
#define USBFS_DEVEPTIMR_KILLBK (0x1u << 13) /**< \brief (USBFS_DEVEPTIMR[5]) Kill IN Bank */
#define USBFS_DEVEPTIMR_FIFOCON (0x1u << 14) /**< \brief (USBFS_DEVEPTIMR[5]) FIFO Control */
#define USBFS_DEVEPTIMR_EPDISHDMA (0x1u << 16) /**< \brief (USBFS_DEVEPTIMR[5]) Endpoint Interrupts Disable HDMA Request */
#define USBFS_DEVEPTIMR_RSTDT (0x1u << 18) /**< \brief (USBFS_DEVEPTIMR[5]) Reset Data Toggle */
#define USBFS_DEVEPTIMR_STALLRQ (0x1u << 19) /**< \brief (USBFS_DEVEPTIMR[5]) STALL Request */
#define USBFS_DEVEPTIMR_UNDERFE (0x1u << 2) /**< \brief (USBFS_DEVEPTIMR[5]) Underflow Interrupt */
#define USBFS_DEVEPTIMR_CRCERRE (0x1u << 6) /**< \brief (USBFS_DEVEPTIMR[5]) CRC Error Interrupt */
/* -------- USBFS_DEVEPTIER[5] : (USBFS Offset: 0x1F0) Device Endpoint Enable Register (n = 0) -------- */
#define USBFS_DEVEPTIER_TXINES (0x1u << 0) /**< \brief (USBFS_DEVEPTIER[5]) Transmitted IN Data Interrupt Enable */
#define USBFS_DEVEPTIER_RXOUTES (0x1u << 1) /**< \brief (USBFS_DEVEPTIER[5]) Received OUT Data Interrupt Enable */
#define USBFS_DEVEPTIER_RXSTPES (0x1u << 2) /**< \brief (USBFS_DEVEPTIER[5]) Received SETUP Interrupt Enable */
#define USBFS_DEVEPTIER_NAKOUTES (0x1u << 3) /**< \brief (USBFS_DEVEPTIER[5]) NAKed OUT Interrupt Enable */
#define USBFS_DEVEPTIER_NAKINES (0x1u << 4) /**< \brief (USBFS_DEVEPTIER[5]) NAKed IN Interrupt Enable */
#define USBFS_DEVEPTIER_OVERFES (0x1u << 5) /**< \brief (USBFS_DEVEPTIER[5]) Overflow Interrupt Enable */
#define USBFS_DEVEPTIER_STALLEDES (0x1u << 6) /**< \brief (USBFS_DEVEPTIER[5]) STALLed Interrupt Enable */
#define USBFS_DEVEPTIER_SHORTPACKETES (0x1u << 7) /**< \brief (USBFS_DEVEPTIER[5]) Short Packet Interrupt Enable */
#define USBFS_DEVEPTIER_NBUSYBKES (0x1u << 12) /**< \brief (USBFS_DEVEPTIER[5]) Number of Busy Banks Interrupt Enable */
#define USBFS_DEVEPTIER_KILLBKS (0x1u << 13) /**< \brief (USBFS_DEVEPTIER[5]) Kill IN Bank */
#define USBFS_DEVEPTIER_FIFOCONS (0x1u << 14) /**< \brief (USBFS_DEVEPTIER[5]) FIFO Control */
#define USBFS_DEVEPTIER_EPDISHDMAS (0x1u << 16) /**< \brief (USBFS_DEVEPTIER[5]) Endpoint Interrupts Disable HDMA Request Enable */
#define USBFS_DEVEPTIER_RSTDTS (0x1u << 18) /**< \brief (USBFS_DEVEPTIER[5]) Reset Data Toggle Enable */
#define USBFS_DEVEPTIER_STALLRQS (0x1u << 19) /**< \brief (USBFS_DEVEPTIER[5]) STALL Request Enable */
#define USBFS_DEVEPTIER_UNDERFES (0x1u << 2) /**< \brief (USBFS_DEVEPTIER[5]) Underflow Interrupt Enable */
#define USBFS_DEVEPTIER_CRCERRES (0x1u << 6) /**< \brief (USBFS_DEVEPTIER[5]) CRC Error Interrupt Enable */
/* -------- USBFS_DEVEPTIDR[5] : (USBFS Offset: 0x220) Device Endpoint Disable Register (n = 0) -------- */
#define USBFS_DEVEPTIDR_TXINEC (0x1u << 0) /**< \brief (USBFS_DEVEPTIDR[5]) Transmitted IN Interrupt Clear */
#define USBFS_DEVEPTIDR_RXOUTEC (0x1u << 1) /**< \brief (USBFS_DEVEPTIDR[5]) Received OUT Data Interrupt Clear */
#define USBFS_DEVEPTIDR_RXSTPEC (0x1u << 2) /**< \brief (USBFS_DEVEPTIDR[5]) Received SETUP Interrupt Clear */
#define USBFS_DEVEPTIDR_NAKOUTEC (0x1u << 3) /**< \brief (USBFS_DEVEPTIDR[5]) NAKed OUT Interrupt Clear */
#define USBFS_DEVEPTIDR_NAKINEC (0x1u << 4) /**< \brief (USBFS_DEVEPTIDR[5]) NAKed IN Interrupt Clear */
#define USBFS_DEVEPTIDR_OVERFEC (0x1u << 5) /**< \brief (USBFS_DEVEPTIDR[5]) Overflow Interrupt Clear */
#define USBFS_DEVEPTIDR_STALLEDEC (0x1u << 6) /**< \brief (USBFS_DEVEPTIDR[5]) STALLed Interrupt Clear */
#define USBFS_DEVEPTIDR_SHORTPACKETEC (0x1u << 7) /**< \brief (USBFS_DEVEPTIDR[5]) Shortpacket Interrupt Clear */
#define USBFS_DEVEPTIDR_NBUSYBKEC (0x1u << 12) /**< \brief (USBFS_DEVEPTIDR[5]) Number of Busy Banks Interrupt Clear */
#define USBFS_DEVEPTIDR_FIFOCONC (0x1u << 14) /**< \brief (USBFS_DEVEPTIDR[5]) FIFO Control Clear */
