OttoDIY/blockly/compilation/arduino/packages/arduino/tools/CMSIS-Atmel/1.2.0/CMSIS/Device/ATMEL/sam4c/include/component/usbfs.h
#define USBFS_DEVEPTIDR_EPDISHDMAC (0x1u << 16) /**< \brief (USBFS_DEVEPTIDR[5]) Endpoint Interrupts Disable HDMA Request Clear */
#define USBFS_DEVEPTIDR_STALLRQC (0x1u << 19) /**< \brief (USBFS_DEVEPTIDR[5]) STALL Request Clear */
#define USBFS_DEVEPTIDR_UNDERFEC (0x1u << 2) /**< \brief (USBFS_DEVEPTIDR[5]) Underflow Interrupt Clear */
#define USBFS_DEVEPTIDR_CRCERREC (0x1u << 6) /**< \brief (USBFS_DEVEPTIDR[5]) CRC Error Interrupt Clear */
/* -------- USBFS_DEVDMANXTDSC : (USBFS Offset: N/A) Device DMA Channel Next Descriptor Address Register -------- */
#define USBFS_DEVDMANXTDSC_NXT_DSC_ADD_Pos 0
#define USBFS_DEVDMANXTDSC_NXT_DSC_ADD_Msk (0xffffffffu << USBFS_DEVDMANXTDSC_NXT_DSC_ADD_Pos) /**< \brief (USBFS_DEVDMANXTDSC) Next Descriptor Address */
#define USBFS_DEVDMANXTDSC_NXT_DSC_ADD(value) ((USBFS_DEVDMANXTDSC_NXT_DSC_ADD_Msk & ((value) << USBFS_DEVDMANXTDSC_NXT_DSC_ADD_Pos)))
/* -------- USBFS_DEVDMAADDRESS : (USBFS Offset: N/A) Device DMA Channel Address Register -------- */
#define USBFS_DEVDMAADDRESS_BUFF_ADD_Pos 0
#define USBFS_DEVDMAADDRESS_BUFF_ADD_Msk (0xffffffffu << USBFS_DEVDMAADDRESS_BUFF_ADD_Pos) /**< \brief (USBFS_DEVDMAADDRESS) Buffer Address */
#define USBFS_DEVDMAADDRESS_BUFF_ADD(value) ((USBFS_DEVDMAADDRESS_BUFF_ADD_Msk & ((value) << USBFS_DEVDMAADDRESS_BUFF_ADD_Pos)))
/* -------- USBFS_DEVDMACONTROL : (USBFS Offset: N/A) Device DMA Channel Control Register -------- */
#define USBFS_DEVDMACONTROL_CHANN_ENB (0x1u << 0) /**< \brief (USBFS_DEVDMACONTROL) Channel Enable Command */
#define USBFS_DEVDMACONTROL_LDNXT_DSC (0x1u << 1) /**< \brief (USBFS_DEVDMACONTROL) Load Next Channel Transfer Descriptor Enable Command */
#define USBFS_DEVDMACONTROL_END_TR_EN (0x1u << 2) /**< \brief (USBFS_DEVDMACONTROL) End of Transfer Enable Control (OUT transfers only) */
#define USBFS_DEVDMACONTROL_END_B_EN (0x1u << 3) /**< \brief (USBFS_DEVDMACONTROL) End of Buffer Enable Control */
#define USBFS_DEVDMACONTROL_END_TR_IT (0x1u << 4) /**< \brief (USBFS_DEVDMACONTROL) End of Transfer Interrupt Enable */
#define USBFS_DEVDMACONTROL_END_BUFFIT (0x1u << 5) /**< \brief (USBFS_DEVDMACONTROL) End of Buffer Interrupt Enable */
#define USBFS_DEVDMACONTROL_DESC_LD_IT (0x1u << 6) /**< \brief (USBFS_DEVDMACONTROL) Descriptor Loaded Interrupt Enable */
#define USBFS_DEVDMACONTROL_BURST_LCK (0x1u << 7) /**< \brief (USBFS_DEVDMACONTROL) Burst Lock Enable */
#define USBFS_DEVDMACONTROL_BUFF_LENGTH_Pos 16
#define USBFS_DEVDMACONTROL_BUFF_LENGTH_Msk (0xffffu << USBFS_DEVDMACONTROL_BUFF_LENGTH_Pos) /**< \brief (USBFS_DEVDMACONTROL) Buffer Byte Length (Write-only) */
#define USBFS_DEVDMACONTROL_BUFF_LENGTH(value) ((USBFS_DEVDMACONTROL_BUFF_LENGTH_Msk & ((value) << USBFS_DEVDMACONTROL_BUFF_LENGTH_Pos)))
/* -------- USBFS_DEVDMASTATUS : (USBFS Offset: N/A) Device DMA Channel Status Register -------- */
#define USBFS_DEVDMASTATUS_CHANN_ENB (0x1u << 0) /**< \brief (USBFS_DEVDMASTATUS) Channel Enable Status */
#define USBFS_DEVDMASTATUS_CHANN_ACT (0x1u << 1) /**< \brief (USBFS_DEVDMASTATUS) Channel Active Status */
#define USBFS_DEVDMASTATUS_END_TR_ST (0x1u << 4) /**< \brief (USBFS_DEVDMASTATUS) End of Channel Transfer Status */
#define USBFS_DEVDMASTATUS_END_BF_ST (0x1u << 5) /**< \brief (USBFS_DEVDMASTATUS) End of Channel Buffer Status */
#define USBFS_DEVDMASTATUS_DESC_LDST (0x1u << 6) /**< \brief (USBFS_DEVDMASTATUS) Descriptor Loaded Status */
#define USBFS_DEVDMASTATUS_BUFF_COUNT_Pos 16
#define USBFS_DEVDMASTATUS_BUFF_COUNT_Msk (0xffffu << USBFS_DEVDMASTATUS_BUFF_COUNT_Pos) /**< \brief (USBFS_DEVDMASTATUS) Buffer Byte Count */
#define USBFS_DEVDMASTATUS_BUFF_COUNT(value) ((USBFS_DEVDMASTATUS_BUFF_COUNT_Msk & ((value) << USBFS_DEVDMASTATUS_BUFF_COUNT_Pos)))
/* -------- USBFS_HSTCTRL : (USBFS Offset: 0x0400) Host General Control Register -------- */
#define USBFS_HSTCTRL_SOFE (0x1u << 8) /**< \brief (USBFS_HSTCTRL) Start of Frame Generation Enable */
#define USBFS_HSTCTRL_RESET (0x1u << 9) /**< \brief (USBFS_HSTCTRL) Send USB Reset */
#define USBFS_HSTCTRL_RESUME (0x1u << 10) /**< \brief (USBFS_HSTCTRL) Send USB Resume */
/* -------- USBFS_HSTISR : (USBFS Offset: 0x0404) Host Global Interrupt Status Register -------- */
#define USBFS_HSTISR_DCONNI (0x1u << 0) /**< \brief (USBFS_HSTISR) Device Connection Interrupt */
#define USBFS_HSTISR_DDISCI (0x1u << 1) /**< \brief (USBFS_HSTISR) Device Disconnection Interrupt */
#define USBFS_HSTISR_RSTI (0x1u << 2) /**< \brief (USBFS_HSTISR) USB Reset Sent Interrupt */
#define USBFS_HSTISR_RSMEDI (0x1u << 3) /**< \brief (USBFS_HSTISR) Downstream Resume Sent Interrupt */
#define USBFS_HSTISR_RXRSMI (0x1u << 4) /**< \brief (USBFS_HSTISR) Upstream Resume Received Interrupt */
#define USBFS_HSTISR_HSOFI (0x1u << 5) /**< \brief (USBFS_HSTISR) Host Start of Frame Interrupt */
#define USBFS_HSTISR_HWUPI (0x1u << 6) /**< \brief (USBFS_HSTISR) Host Wake-Up Interrupt */
#define USBFS_HSTISR_PEP_0 (0x1u << 8) /**< \brief (USBFS_HSTISR) Pipe 0 Interrupt */
#define USBFS_HSTISR_PEP_1 (0x1u << 9) /**< \brief (USBFS_HSTISR) Pipe 1 Interrupt */
#define USBFS_HSTISR_PEP_2 (0x1u << 10) /**< \brief (USBFS_HSTISR) Pipe 2 Interrupt */
#define USBFS_HSTISR_PEP_3 (0x1u << 11) /**< \brief (USBFS_HSTISR) Pipe 3 Interrupt */
#define USBFS_HSTISR_PEP_4 (0x1u << 12) /**< \brief (USBFS_HSTISR) Pipe 4 Interrupt */
#define USBFS_HSTISR_DMA_1 (0x1u << 25) /**< \brief (USBFS_HSTISR) DMA Channel 1 Interrupt */
#define USBFS_HSTISR_DMA_2 (0x1u << 26) /**< \brief (USBFS_HSTISR) DMA Channel 2 Interrupt */
#define USBFS_HSTISR_DMA_3 (0x1u << 27) /**< \brief (USBFS_HSTISR) DMA Channel 3 Interrupt */
#define USBFS_HSTISR_DMA_4 (0x1u << 28) /**< \brief (USBFS_HSTISR) DMA Channel 4 Interrupt */
/* -------- USBFS_HSTICR : (USBFS Offset: 0x0408) Host Global Interrupt Clear Register -------- */
#define USBFS_HSTICR_DCONNIC (0x1u << 0) /**< \brief (USBFS_HSTICR) Device Connection Interrupt Clear */
#define USBFS_HSTICR_DDISCIC (0x1u << 1) /**< \brief (USBFS_HSTICR) Device Disconnection Interrupt Clear */
#define USBFS_HSTICR_RSTIC (0x1u << 2) /**< \brief (USBFS_HSTICR) USB Reset Sent Interrupt Clear */
#define USBFS_HSTICR_RSMEDIC (0x1u << 3) /**< \brief (USBFS_HSTICR) Downstream Resume Sent Interrupt Clear */
#define USBFS_HSTICR_RXRSMIC (0x1u << 4) /**< \brief (USBFS_HSTICR) Upstream Resume Received Interrupt Clear */
#define USBFS_HSTICR_HSOFIC (0x1u << 5) /**< \brief (USBFS_HSTICR) Host Start of Frame Interrupt Clear */
#define USBFS_HSTICR_HWUPIC (0x1u << 6) /**< \brief (USBFS_HSTICR) Host Wake-Up Interrupt Clear */
/* -------- USBFS_HSTIFR : (USBFS Offset: 0x040C) Host Global Interrupt Set Register -------- */
#define USBFS_HSTIFR_DCONNIS (0x1u << 0) /**< \brief (USBFS_HSTIFR) Device Connection Interrupt Set */
#define USBFS_HSTIFR_DDISCIS (0x1u << 1) /**< \brief (USBFS_HSTIFR) Device Disconnection Interrupt Set */
#define USBFS_HSTIFR_RSTIS (0x1u << 2) /**< \brief (USBFS_HSTIFR) USB Reset Sent Interrupt Set */
#define USBFS_HSTIFR_RSMEDIS (0x1u << 3) /**< \brief (USBFS_HSTIFR) Downstream Resume Sent Interrupt Set */
#define USBFS_HSTIFR_RXRSMIS (0x1u << 4) /**< \brief (USBFS_HSTIFR) Upstream Resume Received Interrupt Set */
#define USBFS_HSTIFR_HSOFIS (0x1u << 5) /**< \brief (USBFS_HSTIFR) Host Start of Frame Interrupt Set */
#define USBFS_HSTIFR_HWUPIS (0x1u << 6) /**< \brief (USBFS_HSTIFR) Host Wake-Up Interrupt Set */
#define USBFS_HSTIFR_DMA_1 (0x1u << 25) /**< \brief (USBFS_HSTIFR) DMA Channel 1 Interrupt Set */
#define USBFS_HSTIFR_DMA_2 (0x1u << 26) /**< \brief (USBFS_HSTIFR) DMA Channel 2 Interrupt Set */
#define USBFS_HSTIFR_DMA_3 (0x1u << 27) /**< \brief (USBFS_HSTIFR) DMA Channel 3 Interrupt Set */
#define USBFS_HSTIFR_DMA_4 (0x1u << 28) /**< \brief (USBFS_HSTIFR) DMA Channel 4 Interrupt Set */
/* -------- USBFS_HSTIMR : (USBFS Offset: 0x0410) Host Global Interrupt Mask Register -------- */
#define USBFS_HSTIMR_DCONNIE (0x1u << 0) /**< \brief (USBFS_HSTIMR) Device Connection Interrupt Enable */
#define USBFS_HSTIMR_DDISCIE (0x1u << 1) /**< \brief (USBFS_HSTIMR) Device Disconnection Interrupt Enable */
#define USBFS_HSTIMR_RSTIE (0x1u << 2) /**< \brief (USBFS_HSTIMR) USB Reset Sent Interrupt Enable */
#define USBFS_HSTIMR_RSMEDIE (0x1u << 3) /**< \brief (USBFS_HSTIMR) Downstream Resume Sent Interrupt Enable */
#define USBFS_HSTIMR_RXRSMIE (0x1u << 4) /**< \brief (USBFS_HSTIMR) Upstream Resume Received Interrupt Enable */
#define USBFS_HSTIMR_HSOFIE (0x1u << 5) /**< \brief (USBFS_HSTIMR) Host Start of Frame Interrupt Enable */
#define USBFS_HSTIMR_HWUPIE (0x1u << 6) /**< \brief (USBFS_HSTIMR) Host Wake-Up Interrupt Enable */
#define USBFS_HSTIMR_PEP_0 (0x1u << 8) /**< \brief (USBFS_HSTIMR) Pipe 0 Interrupt Enable */
#define USBFS_HSTIMR_PEP_1 (0x1u << 9) /**< \brief (USBFS_HSTIMR) Pipe 1 Interrupt Enable */
#define USBFS_HSTIMR_PEP_2 (0x1u << 10) /**< \brief (USBFS_HSTIMR) Pipe 2 Interrupt Enable */
#define USBFS_HSTIMR_PEP_3 (0x1u << 11) /**< \brief (USBFS_HSTIMR) Pipe 3 Interrupt Enable */
#define USBFS_HSTIMR_PEP_4 (0x1u << 12) /**< \brief (USBFS_HSTIMR) Pipe 4 Interrupt Enable */
#define USBFS_HSTIMR_DMA_1 (0x1u << 25) /**< \brief (USBFS_HSTIMR) DMA Channel 1 Interrupt Enable */
#define USBFS_HSTIMR_DMA_2 (0x1u << 26) /**< \brief (USBFS_HSTIMR) DMA Channel 2 Interrupt Enable */
#define USBFS_HSTIMR_DMA_3 (0x1u << 27) /**< \brief (USBFS_HSTIMR) DMA Channel 3 Interrupt Enable */
#define USBFS_HSTIMR_DMA_4 (0x1u << 28) /**< \brief (USBFS_HSTIMR) DMA Channel 4 Interrupt Enable */
/* -------- USBFS_HSTIDR : (USBFS Offset: 0x0414) Host Global Interrupt Disable Register -------- */
#define USBFS_HSTIDR_DCONNIEC (0x1u << 0) /**< \brief (USBFS_HSTIDR) Device Connection Interrupt Disable */
#define USBFS_HSTIDR_DDISCIEC (0x1u << 1) /**< \brief (USBFS_HSTIDR) Device Disconnection Interrupt Disable */
#define USBFS_HSTIDR_RSTIEC (0x1u << 2) /**< \brief (USBFS_HSTIDR) USB Reset Sent Interrupt Disable */
#define USBFS_HSTIDR_RSMEDIEC (0x1u << 3) /**< \brief (USBFS_HSTIDR) Downstream Resume Sent Interrupt Disable */
#define USBFS_HSTIDR_RXRSMIEC (0x1u << 4) /**< \brief (USBFS_HSTIDR) Upstream Resume Received Interrupt Disable */
#define USBFS_HSTIDR_HSOFIEC (0x1u << 5) /**< \brief (USBFS_HSTIDR) Host Start of Frame Interrupt Disable */
#define USBFS_HSTIDR_HWUPIEC (0x1u << 6) /**< \brief (USBFS_HSTIDR) Host Wake-Up Interrupt Disable */
#define USBFS_HSTIDR_PEP_0 (0x1u << 8) /**< \brief (USBFS_HSTIDR) Pipe 0 Interrupt Disable */
#define USBFS_HSTIDR_PEP_1 (0x1u << 9) /**< \brief (USBFS_HSTIDR) Pipe 1 Interrupt Disable */
#define USBFS_HSTIDR_PEP_2 (0x1u << 10) /**< \brief (USBFS_HSTIDR) Pipe 2 Interrupt Disable */
#define USBFS_HSTIDR_PEP_3 (0x1u << 11) /**< \brief (USBFS_HSTIDR) Pipe 3 Interrupt Disable */
#define USBFS_HSTIDR_PEP_4 (0x1u << 12) /**< \brief (USBFS_HSTIDR) Pipe 4 Interrupt Disable */
#define USBFS_HSTIDR_DMA_1 (0x1u << 25) /**< \brief (USBFS_HSTIDR) DMA Channel 1 Interrupt Disable */
#define USBFS_HSTIDR_DMA_2 (0x1u << 26) /**< \brief (USBFS_HSTIDR) DMA Channel 2 Interrupt Disable */
#define USBFS_HSTIDR_DMA_3 (0x1u << 27) /**< \brief (USBFS_HSTIDR) DMA Channel 3 Interrupt Disable */
#define USBFS_HSTIDR_DMA_4 (0x1u << 28) /**< \brief (USBFS_HSTIDR) DMA Channel 4 Interrupt Disable */
/* -------- USBFS_HSTIER : (USBFS Offset: 0x0418) Host Global Interrupt Enable Register -------- */
#define USBFS_HSTIER_DCONNIES (0x1u << 0) /**< \brief (USBFS_HSTIER) Device Connection Interrupt Enable */
#define USBFS_HSTIER_DDISCIES (0x1u << 1) /**< \brief (USBFS_HSTIER) Device Disconnection Interrupt Enable */
#define USBFS_HSTIER_RSTIES (0x1u << 2) /**< \brief (USBFS_HSTIER) USB Reset Sent Interrupt Enable */
#define USBFS_HSTIER_RSMEDIES (0x1u << 3) /**< \brief (USBFS_HSTIER) Downstream Resume Sent Interrupt Enable */
#define USBFS_HSTIER_RXRSMIES (0x1u << 4) /**< \brief (USBFS_HSTIER) Upstream Resume Received Interrupt Enable */
#define USBFS_HSTIER_HSOFIES (0x1u << 5) /**< \brief (USBFS_HSTIER) Host Start of Frame Interrupt Enable */
#define USBFS_HSTIER_HWUPIES (0x1u << 6) /**< \brief (USBFS_HSTIER) Host Wake-Up Interrupt Enable */
#define USBFS_HSTIER_PEP_0 (0x1u << 8) /**< \brief (USBFS_HSTIER) Pipe 0 Interrupt Enable */
#define USBFS_HSTIER_PEP_1 (0x1u << 9) /**< \brief (USBFS_HSTIER) Pipe 1 Interrupt Enable */
#define USBFS_HSTIER_PEP_2 (0x1u << 10) /**< \brief (USBFS_HSTIER) Pipe 2 Interrupt Enable */
#define USBFS_HSTIER_PEP_3 (0x1u << 11) /**< \brief (USBFS_HSTIER) Pipe 3 Interrupt Enable */
#define USBFS_HSTIER_PEP_4 (0x1u << 12) /**< \brief (USBFS_HSTIER) Pipe 4 Interrupt Enable */
#define USBFS_HSTIER_DMA_1 (0x1u << 25) /**< \brief (USBFS_HSTIER) DMA Channel 1 Interrupt Enable */
#define USBFS_HSTIER_DMA_2 (0x1u << 26) /**< \brief (USBFS_HSTIER) DMA Channel 2 Interrupt Enable */
#define USBFS_HSTIER_DMA_3 (0x1u << 27) /**< \brief (USBFS_HSTIER) DMA Channel 3 Interrupt Enable */
#define USBFS_HSTIER_DMA_4 (0x1u << 28) /**< \brief (USBFS_HSTIER) DMA Channel 4 Interrupt Enable */
/* -------- USBFS_HSTPIP : (USBFS Offset: 0x0041C) Host Pipe Register -------- */
#define USBFS_HSTPIP_PEN0 (0x1u << 0) /**< \brief (USBFS_HSTPIP) Pipe 0 Enable */
#define USBFS_HSTPIP_PEN1 (0x1u << 1) /**< \brief (USBFS_HSTPIP) Pipe 1 Enable */
#define USBFS_HSTPIP_PEN2 (0x1u << 2) /**< \brief (USBFS_HSTPIP) Pipe 2 Enable */
#define USBFS_HSTPIP_PEN3 (0x1u << 3) /**< \brief (USBFS_HSTPIP) Pipe 3 Enable */
#define USBFS_HSTPIP_PEN4 (0x1u << 4) /**< \brief (USBFS_HSTPIP) Pipe 4 Enable */
#define USBFS_HSTPIP_PEN5 (0x1u << 5) /**< \brief (USBFS_HSTPIP) Pipe 5 Enable */
#define USBFS_HSTPIP_PEN6 (0x1u << 6) /**< \brief (USBFS_HSTPIP) Pipe 6 Enable */
#define USBFS_HSTPIP_PEN7 (0x1u << 7) /**< \brief (USBFS_HSTPIP) Pipe 7 Enable */
#define USBFS_HSTPIP_PEN8 (0x1u << 8) /**< \brief (USBFS_HSTPIP) Pipe 8 Enable */
#define USBFS_HSTPIP_PRST0 (0x1u << 16) /**< \brief (USBFS_HSTPIP) Pipe 0 Reset */
#define USBFS_HSTPIP_PRST1 (0x1u << 17) /**< \brief (USBFS_HSTPIP) Pipe 1 Reset */
#define USBFS_HSTPIP_PRST2 (0x1u << 18) /**< \brief (USBFS_HSTPIP) Pipe 2 Reset */
#define USBFS_HSTPIP_PRST3 (0x1u << 19) /**< \brief (USBFS_HSTPIP) Pipe 3 Reset */
#define USBFS_HSTPIP_PRST4 (0x1u << 20) /**< \brief (USBFS_HSTPIP) Pipe 4 Reset */
#define USBFS_HSTPIP_PRST5 (0x1u << 21) /**< \brief (USBFS_HSTPIP) Pipe 5 Reset */
#define USBFS_HSTPIP_PRST6 (0x1u << 22) /**< \brief (USBFS_HSTPIP) Pipe 6 Reset */
#define USBFS_HSTPIP_PRST7 (0x1u << 23) /**< \brief (USBFS_HSTPIP) Pipe 7 Reset */
#define USBFS_HSTPIP_PRST8 (0x1u << 24) /**< \brief (USBFS_HSTPIP) Pipe 8 Reset */
/* -------- USBFS_HSTFNUM : (USBFS Offset: 0x0420) Host Frame Number Register -------- */
#define USBFS_HSTFNUM_FNUM_Pos 3
#define USBFS_HSTFNUM_FNUM_Msk (0x7ffu << USBFS_HSTFNUM_FNUM_Pos) /**< \brief (USBFS_HSTFNUM) Frame Number */
#define USBFS_HSTFNUM_FNUM(value) ((USBFS_HSTFNUM_FNUM_Msk & ((value) << USBFS_HSTFNUM_FNUM_Pos)))
#define USBFS_HSTFNUM_FLENHIGH_Pos 16
#define USBFS_HSTFNUM_FLENHIGH_Msk (0xffu << USBFS_HSTFNUM_FLENHIGH_Pos) /**< \brief (USBFS_HSTFNUM) Frame Length */
#define USBFS_HSTFNUM_FLENHIGH(value) ((USBFS_HSTFNUM_FLENHIGH_Msk & ((value) << USBFS_HSTFNUM_FLENHIGH_Pos)))
/* -------- USBFS_HSTADDR1 : (USBFS Offset: 0x0424) Host Address 1 Register -------- */
#define USBFS_HSTADDR1_HSTADDRP0_Pos 0
#define USBFS_HSTADDR1_HSTADDRP0_Msk (0x7fu << USBFS_HSTADDR1_HSTADDRP0_Pos) /**< \brief (USBFS_HSTADDR1) USB Host Address */
#define USBFS_HSTADDR1_HSTADDRP0(value) ((USBFS_HSTADDR1_HSTADDRP0_Msk & ((value) << USBFS_HSTADDR1_HSTADDRP0_Pos)))
#define USBFS_HSTADDR1_HSTADDRP1_Pos 8
#define USBFS_HSTADDR1_HSTADDRP1_Msk (0x7fu << USBFS_HSTADDR1_HSTADDRP1_Pos) /**< \brief (USBFS_HSTADDR1) USB Host Address */
#define USBFS_HSTADDR1_HSTADDRP1(value) ((USBFS_HSTADDR1_HSTADDRP1_Msk & ((value) << USBFS_HSTADDR1_HSTADDRP1_Pos)))
#define USBFS_HSTADDR1_HSTADDRP2_Pos 16
#define USBFS_HSTADDR1_HSTADDRP2_Msk (0x7fu << USBFS_HSTADDR1_HSTADDRP2_Pos) /**< \brief (USBFS_HSTADDR1) USB Host Address */
#define USBFS_HSTADDR1_HSTADDRP2(value) ((USBFS_HSTADDR1_HSTADDRP2_Msk & ((value) << USBFS_HSTADDR1_HSTADDRP2_Pos)))
#define USBFS_HSTADDR1_HSTADDRP3_Pos 24
#define USBFS_HSTADDR1_HSTADDRP3_Msk (0x7fu << USBFS_HSTADDR1_HSTADDRP3_Pos) /**< \brief (USBFS_HSTADDR1) USB Host Address */
#define USBFS_HSTADDR1_HSTADDRP3(value) ((USBFS_HSTADDR1_HSTADDRP3_Msk & ((value) << USBFS_HSTADDR1_HSTADDRP3_Pos)))
/* -------- USBFS_HSTADDR2 : (USBFS Offset: 0x0428) Host Address 2 Register -------- */
#define USBFS_HSTADDR2_HSTADDRP4_Pos 0
#define USBFS_HSTADDR2_HSTADDRP4_Msk (0x7fu << USBFS_HSTADDR2_HSTADDRP4_Pos) /**< \brief (USBFS_HSTADDR2) USB Host Address */
#define USBFS_HSTADDR2_HSTADDRP4(value) ((USBFS_HSTADDR2_HSTADDRP4_Msk & ((value) << USBFS_HSTADDR2_HSTADDRP4_Pos)))
#define USBFS_HSTADDR2_HSTADDRP5_Pos 8
#define USBFS_HSTADDR2_HSTADDRP5_Msk (0x7fu << USBFS_HSTADDR2_HSTADDRP5_Pos) /**< \brief (USBFS_HSTADDR2) USB Host Address */
#define USBFS_HSTADDR2_HSTADDRP5(value) ((USBFS_HSTADDR2_HSTADDRP5_Msk & ((value) << USBFS_HSTADDR2_HSTADDRP5_Pos)))
#define USBFS_HSTADDR2_HSTADDRP6_Pos 16
#define USBFS_HSTADDR2_HSTADDRP6_Msk (0x7fu << USBFS_HSTADDR2_HSTADDRP6_Pos) /**< \brief (USBFS_HSTADDR2) USB Host Address */
#define USBFS_HSTADDR2_HSTADDRP6(value) ((USBFS_HSTADDR2_HSTADDRP6_Msk & ((value) << USBFS_HSTADDR2_HSTADDRP6_Pos)))
#define USBFS_HSTADDR2_HSTADDRP7_Pos 24
#define USBFS_HSTADDR2_HSTADDRP7_Msk (0x7fu << USBFS_HSTADDR2_HSTADDRP7_Pos) /**< \brief (USBFS_HSTADDR2) USB Host Address */
#define USBFS_HSTADDR2_HSTADDRP7(value) ((USBFS_HSTADDR2_HSTADDRP7_Msk & ((value) << USBFS_HSTADDR2_HSTADDRP7_Pos)))
/* -------- USBFS_HSTADDR3 : (USBFS Offset: 0x042C) Host Address 3 Register -------- */
#define USBFS_HSTADDR3_HSTADDRP8_Pos 0
#define USBFS_HSTADDR3_HSTADDRP8_Msk (0x7fu << USBFS_HSTADDR3_HSTADDRP8_Pos) /**< \brief (USBFS_HSTADDR3) USB Host Address */
#define USBFS_HSTADDR3_HSTADDRP8(value) ((USBFS_HSTADDR3_HSTADDRP8_Msk & ((value) << USBFS_HSTADDR3_HSTADDRP8_Pos)))
#define USBFS_HSTADDR3_HSTADDRP9_Pos 8
#define USBFS_HSTADDR3_HSTADDRP9_Msk (0x7fu << USBFS_HSTADDR3_HSTADDRP9_Pos) /**< \brief (USBFS_HSTADDR3) USB Host Address */
#define USBFS_HSTADDR3_HSTADDRP9(value) ((USBFS_HSTADDR3_HSTADDRP9_Msk & ((value) << USBFS_HSTADDR3_HSTADDRP9_Pos)))
/* -------- USBFS_HSTPIPCFG[5] : (USBFS Offset: 0x500) Host Pipe Configuration Register (n = 0) -------- */
#define USBFS_HSTPIPCFG_ALLOC (0x1u << 1) /**< \brief (USBFS_HSTPIPCFG[5]) Pipe Memory Allocate */
#define USBFS_HSTPIPCFG_PBK_Pos 2
#define USBFS_HSTPIPCFG_PBK_Msk (0x3u << USBFS_HSTPIPCFG_PBK_Pos) /**< \brief (USBFS_HSTPIPCFG[5]) Pipe Banks */
#define USBFS_HSTPIPCFG_PBK(value) ((USBFS_HSTPIPCFG_PBK_Msk & ((value) << USBFS_HSTPIPCFG_PBK_Pos)))
#define   USBFS_HSTPIPCFG_PBK_1_BANK (0x0u << 2) /**< \brief (USBFS_HSTPIPCFG[5]) Single-bank pipe */
#define   USBFS_HSTPIPCFG_PBK_2_BANK (0x1u << 2) /**< \brief (USBFS_HSTPIPCFG[5]) Double-bank pipe */
#define   USBFS_HSTPIPCFG_PBK_3_BANK (0x2u << 2) /**< \brief (USBFS_HSTPIPCFG[5]) Triple-bank pipe */
#define USBFS_HSTPIPCFG_PSIZE_Pos 4
#define USBFS_HSTPIPCFG_PSIZE_Msk (0x7u << USBFS_HSTPIPCFG_PSIZE_Pos) /**< \brief (USBFS_HSTPIPCFG[5]) Pipe Size */
#define USBFS_HSTPIPCFG_PSIZE(value) ((USBFS_HSTPIPCFG_PSIZE_Msk & ((value) << USBFS_HSTPIPCFG_PSIZE_Pos)))
#define   USBFS_HSTPIPCFG_PSIZE_8_BYTE (0x0u << 4) /**< \brief (USBFS_HSTPIPCFG[5]) 8 bytes */
#define   USBFS_HSTPIPCFG_PSIZE_16_BYTE (0x1u << 4) /**< \brief (USBFS_HSTPIPCFG[5]) 16 bytes */
#define   USBFS_HSTPIPCFG_PSIZE_32_BYTE (0x2u << 4) /**< \brief (USBFS_HSTPIPCFG[5]) 32 bytes */
#define   USBFS_HSTPIPCFG_PSIZE_64_BYTE (0x3u << 4) /**< \brief (USBFS_HSTPIPCFG[5]) 64 bytes */
#define   USBFS_HSTPIPCFG_PSIZE_128_BYTE (0x4u << 4) /**< \brief (USBFS_HSTPIPCFG[5]) 128 bytes */
#define   USBFS_HSTPIPCFG_PSIZE_256_BYTE (0x5u << 4) /**< \brief (USBFS_HSTPIPCFG[5]) 256 bytes */
#define   USBFS_HSTPIPCFG_PSIZE_512_BYTE (0x6u << 4) /**< \brief (USBFS_HSTPIPCFG[5]) 512 bytes */
#define   USBFS_HSTPIPCFG_PSIZE_1024_BYTE (0x7u << 4) /**< \brief (USBFS_HSTPIPCFG[5]) 1024 bytes */
#define USBFS_HSTPIPCFG_PTOKEN_Pos 8
#define USBFS_HSTPIPCFG_PTOKEN_Msk (0x3u << USBFS_HSTPIPCFG_PTOKEN_Pos) /**< \brief (USBFS_HSTPIPCFG[5]) Pipe Token */
#define USBFS_HSTPIPCFG_PTOKEN(value) ((USBFS_HSTPIPCFG_PTOKEN_Msk & ((value) << USBFS_HSTPIPCFG_PTOKEN_Pos)))
#define   USBFS_HSTPIPCFG_PTOKEN_SETUP (0x0u << 8) /**< \brief (USBFS_HSTPIPCFG[5]) SETUP */
#define   USBFS_HSTPIPCFG_PTOKEN_IN (0x1u << 8) /**< \brief (USBFS_HSTPIPCFG[5]) IN */
#define   USBFS_HSTPIPCFG_PTOKEN_OUT (0x2u << 8) /**< \brief (USBFS_HSTPIPCFG[5]) OUT */
#define USBFS_HSTPIPCFG_AUTOSW (0x1u << 10) /**< \brief (USBFS_HSTPIPCFG[5]) Automatic Switch */
#define USBFS_HSTPIPCFG_PTYPE_Pos 12
#define USBFS_HSTPIPCFG_PTYPE_Msk (0x3u << USBFS_HSTPIPCFG_PTYPE_Pos) /**< \brief (USBFS_HSTPIPCFG[5]) Pipe Type */
#define USBFS_HSTPIPCFG_PTYPE(value) ((USBFS_HSTPIPCFG_PTYPE_Msk & ((value) << USBFS_HSTPIPCFG_PTYPE_Pos)))
#define   USBFS_HSTPIPCFG_PTYPE_CTRL (0x0u << 12) /**< \brief (USBFS_HSTPIPCFG[5]) Control */
#define   USBFS_HSTPIPCFG_PTYPE_ISO (0x1u << 12) /**< \brief (USBFS_HSTPIPCFG[5]) Isochronous */
#define   USBFS_HSTPIPCFG_PTYPE_BLK (0x2u << 12) /**< \brief (USBFS_HSTPIPCFG[5]) Bulk */
#define   USBFS_HSTPIPCFG_PTYPE_INTRPT (0x3u << 12) /**< \brief (USBFS_HSTPIPCFG[5]) Interrupt */
#define USBFS_HSTPIPCFG_PEPNUM_Pos 16
#define USBFS_HSTPIPCFG_PEPNUM_Msk (0xfu << USBFS_HSTPIPCFG_PEPNUM_Pos) /**< \brief (USBFS_HSTPIPCFG[5]) Pipe Endpoint Number */
#define USBFS_HSTPIPCFG_PEPNUM(value) ((USBFS_HSTPIPCFG_PEPNUM_Msk & ((value) << USBFS_HSTPIPCFG_PEPNUM_Pos)))
#define USBFS_HSTPIPCFG_INTFRQ_Pos 24
#define USBFS_HSTPIPCFG_INTFRQ_Msk (0xffu << USBFS_HSTPIPCFG_INTFRQ_Pos) /**< \brief (USBFS_HSTPIPCFG[5]) Pipe Interrupt Request Frequency */
#define USBFS_HSTPIPCFG_INTFRQ(value) ((USBFS_HSTPIPCFG_INTFRQ_Msk & ((value) << USBFS_HSTPIPCFG_INTFRQ_Pos)))
/* -------- USBFS_HSTPIPISR[5] : (USBFS Offset: 0x530) Host Pipe Status Register (n = 0) -------- */
#define USBFS_HSTPIPISR_RXINI (0x1u << 0) /**< \brief (USBFS_HSTPIPISR[5]) Received IN Data Interrupt */
#define USBFS_HSTPIPISR_TXOUTI (0x1u << 1) /**< \brief (USBFS_HSTPIPISR[5]) Transmitted OUT Data Interrupt */
#define USBFS_HSTPIPISR_TXSTPI (0x1u << 2) /**< \brief (USBFS_HSTPIPISR[5]) Transmitted SETUP Interrupt */
#define USBFS_HSTPIPISR_PERRI (0x1u << 3) /**< \brief (USBFS_HSTPIPISR[5]) Pipe Error Interrupt */
#define USBFS_HSTPIPISR_NAKEDI (0x1u << 4) /**< \brief (USBFS_HSTPIPISR[5]) NAKed Interrupt */
#define USBFS_HSTPIPISR_OVERFI (0x1u << 5) /**< \brief (USBFS_HSTPIPISR[5]) Overflow Interrupt */
#define USBFS_HSTPIPISR_RXSTALLDI (0x1u << 6) /**< \brief (USBFS_HSTPIPISR[5]) Received STALLed Interrupt */
#define USBFS_HSTPIPISR_SHORTPACKETI (0x1u << 7) /**< \brief (USBFS_HSTPIPISR[5]) Short Packet Interrupt */
#define USBFS_HSTPIPISR_DTSEQ_Pos 8
#define USBFS_HSTPIPISR_DTSEQ_Msk (0x3u << USBFS_HSTPIPISR_DTSEQ_Pos) /**< \brief (USBFS_HSTPIPISR[5]) Data Toggle Sequence */
#define   USBFS_HSTPIPISR_DTSEQ_DATA0 (0x0u << 8) /**< \brief (USBFS_HSTPIPISR[5]) Data0 toggle sequence */
#define   USBFS_HSTPIPISR_DTSEQ_DATA1 (0x1u << 8) /**< \brief (USBFS_HSTPIPISR[5]) Data1 toggle sequence */
#define USBFS_HSTPIPISR_NBUSYBK_Pos 12
#define USBFS_HSTPIPISR_NBUSYBK_Msk (0x3u << USBFS_HSTPIPISR_NBUSYBK_Pos) /**< \brief (USBFS_HSTPIPISR[5]) Number of Busy Banks */
#define   USBFS_HSTPIPISR_NBUSYBK_0_BUSY (0x0u << 12) /**< \brief (USBFS_HSTPIPISR[5]) 0 busy bank (all banks free) */
#define   USBFS_HSTPIPISR_NBUSYBK_1_BUSY (0x1u << 12) /**< \brief (USBFS_HSTPIPISR[5]) 1 busy bank */
#define   USBFS_HSTPIPISR_NBUSYBK_2_BUSY (0x2u << 12) /**< \brief (USBFS_HSTPIPISR[5]) 2 busy banks */
#define   USBFS_HSTPIPISR_NBUSYBK_3_BUSY (0x3u << 12) /**< \brief (USBFS_HSTPIPISR[5]) 3 busy banks */
#define USBFS_HSTPIPISR_CURRBK_Pos 14
#define USBFS_HSTPIPISR_CURRBK_Msk (0x3u << USBFS_HSTPIPISR_CURRBK_Pos) /**< \brief (USBFS_HSTPIPISR[5]) Current Bank */
#define   USBFS_HSTPIPISR_CURRBK_BANK0 (0x0u << 14) /**< \brief (USBFS_HSTPIPISR[5]) Current bank is bank0 */
