OttoDIY/blockly/compilation/arduino/packages/arduino/tools/CMSIS-Atmel/1.2.0/CMSIS/Device/ATMEL/sam4c/include/component/usbfs.h
#define   USBFS_HSTPIPISR_CURRBK_BANK1 (0x1u << 14) /**< \brief (USBFS_HSTPIPISR[5]) Current bank is bank1 */
#define   USBFS_HSTPIPISR_CURRBK_BANK2 (0x2u << 14) /**< \brief (USBFS_HSTPIPISR[5]) Current bank is bank2 */
#define USBFS_HSTPIPISR_RWALL (0x1u << 16) /**< \brief (USBFS_HSTPIPISR[5]) Read/Write Allowed */
#define USBFS_HSTPIPISR_CFGOK (0x1u << 18) /**< \brief (USBFS_HSTPIPISR[5]) Configuration OK Status */
#define USBFS_HSTPIPISR_PBYCT_Pos 20
#define USBFS_HSTPIPISR_PBYCT_Msk (0x7ffu << USBFS_HSTPIPISR_PBYCT_Pos) /**< \brief (USBFS_HSTPIPISR[5]) Pipe Byte Count */
#define USBFS_HSTPIPISR_UNDERFI (0x1u << 2) /**< \brief (USBFS_HSTPIPISR[5]) Underflow Interrupt */
#define USBFS_HSTPIPISR_CRCERRI (0x1u << 6) /**< \brief (USBFS_HSTPIPISR[5]) CRC Error Interrupt */
/* -------- USBFS_HSTPIPICR[5] : (USBFS Offset: 0x560) Host Pipe Clear Register (n = 0) -------- */
#define USBFS_HSTPIPICR_RXINIC (0x1u << 0) /**< \brief (USBFS_HSTPIPICR[5]) Received IN Data Interrupt Clear */
#define USBFS_HSTPIPICR_TXOUTIC (0x1u << 1) /**< \brief (USBFS_HSTPIPICR[5]) Transmitted OUT Data Interrupt Clear */
#define USBFS_HSTPIPICR_TXSTPIC (0x1u << 2) /**< \brief (USBFS_HSTPIPICR[5]) Transmitted SETUP Interrupt Clear */
#define USBFS_HSTPIPICR_NAKEDIC (0x1u << 4) /**< \brief (USBFS_HSTPIPICR[5]) NAKed Interrupt Clear */
#define USBFS_HSTPIPICR_OVERFIC (0x1u << 5) /**< \brief (USBFS_HSTPIPICR[5]) Overflow Interrupt Clear */
#define USBFS_HSTPIPICR_RXSTALLDIC (0x1u << 6) /**< \brief (USBFS_HSTPIPICR[5]) Received STALLed Interrupt Clear */
#define USBFS_HSTPIPICR_SHORTPACKETIC (0x1u << 7) /**< \brief (USBFS_HSTPIPICR[5]) Short Packet Interrupt Clear */
#define USBFS_HSTPIPICR_UNDERFIC (0x1u << 2) /**< \brief (USBFS_HSTPIPICR[5]) Underflow Interrupt Clear */
#define USBFS_HSTPIPICR_CRCERRIC (0x1u << 6) /**< \brief (USBFS_HSTPIPICR[5]) CRC Error Interrupt Clear */
/* -------- USBFS_HSTPIPIFR[5] : (USBFS Offset: 0x590) Host Pipe Set Register (n = 0) -------- */
#define USBFS_HSTPIPIFR_RXINIS (0x1u << 0) /**< \brief (USBFS_HSTPIPIFR[5]) Received IN Data Interrupt Set */
#define USBFS_HSTPIPIFR_TXOUTIS (0x1u << 1) /**< \brief (USBFS_HSTPIPIFR[5]) Transmitted OUT Data Interrupt Set */
#define USBFS_HSTPIPIFR_TXSTPIS (0x1u << 2) /**< \brief (USBFS_HSTPIPIFR[5]) Transmitted SETUP Interrupt Set */
#define USBFS_HSTPIPIFR_PERRIS (0x1u << 3) /**< \brief (USBFS_HSTPIPIFR[5]) Pipe Error Interrupt Set */
#define USBFS_HSTPIPIFR_NAKEDIS (0x1u << 4) /**< \brief (USBFS_HSTPIPIFR[5]) NAKed Interrupt Set */
#define USBFS_HSTPIPIFR_OVERFIS (0x1u << 5) /**< \brief (USBFS_HSTPIPIFR[5]) Overflow Interrupt Set */
#define USBFS_HSTPIPIFR_RXSTALLDIS (0x1u << 6) /**< \brief (USBFS_HSTPIPIFR[5]) Received STALLed Interrupt Set */
#define USBFS_HSTPIPIFR_SHORTPACKETIS (0x1u << 7) /**< \brief (USBFS_HSTPIPIFR[5]) Short Packet Interrupt Set */
#define USBFS_HSTPIPIFR_NBUSYBKS (0x1u << 12) /**< \brief (USBFS_HSTPIPIFR[5]) Number of Busy Banks Set */
#define USBFS_HSTPIPIFR_UNDERFIS (0x1u << 2) /**< \brief (USBFS_HSTPIPIFR[5]) Underflow Interrupt Set */
#define USBFS_HSTPIPIFR_CRCERRIS (0x1u << 6) /**< \brief (USBFS_HSTPIPIFR[5]) CRC Error Interrupt Set */
/* -------- USBFS_HSTPIPIMR[5] : (USBFS Offset: 0x5C0) Host Pipe Mask Register (n = 0) -------- */
#define USBFS_HSTPIPIMR_RXINE (0x1u << 0) /**< \brief (USBFS_HSTPIPIMR[5]) Received IN Data Interrupt Enable */
#define USBFS_HSTPIPIMR_TXOUTE (0x1u << 1) /**< \brief (USBFS_HSTPIPIMR[5]) Transmitted OUT Data Interrupt Enable */
#define USBFS_HSTPIPIMR_TXSTPE (0x1u << 2) /**< \brief (USBFS_HSTPIPIMR[5]) Transmitted SETUP Interrupt Enable */
#define USBFS_HSTPIPIMR_PERRE (0x1u << 3) /**< \brief (USBFS_HSTPIPIMR[5]) Pipe Error Interrupt Enable */
#define USBFS_HSTPIPIMR_NAKEDE (0x1u << 4) /**< \brief (USBFS_HSTPIPIMR[5]) NAKed Interrupt Enable */
#define USBFS_HSTPIPIMR_OVERFIE (0x1u << 5) /**< \brief (USBFS_HSTPIPIMR[5]) Overflow Interrupt Enable */
#define USBFS_HSTPIPIMR_RXSTALLDE (0x1u << 6) /**< \brief (USBFS_HSTPIPIMR[5]) Received STALLed Interrupt Enable */
#define USBFS_HSTPIPIMR_SHORTPACKETIE (0x1u << 7) /**< \brief (USBFS_HSTPIPIMR[5]) Short Packet Interrupt Enable */
#define USBFS_HSTPIPIMR_NBUSYBKE (0x1u << 12) /**< \brief (USBFS_HSTPIPIMR[5]) Number of Busy Banks Interrupt Enable */
#define USBFS_HSTPIPIMR_FIFOCON (0x1u << 14) /**< \brief (USBFS_HSTPIPIMR[5]) FIFO Control */
#define USBFS_HSTPIPIMR_PDISHDMA (0x1u << 16) /**< \brief (USBFS_HSTPIPIMR[5]) Pipe Interrupts Disable HDMA Request Enable */
#define USBFS_HSTPIPIMR_PFREEZE (0x1u << 17) /**< \brief (USBFS_HSTPIPIMR[5]) Pipe Freeze */
#define USBFS_HSTPIPIMR_RSTDT (0x1u << 18) /**< \brief (USBFS_HSTPIPIMR[5]) Reset Data Toggle */
#define USBFS_HSTPIPIMR_UNDERFIE (0x1u << 2) /**< \brief (USBFS_HSTPIPIMR[5]) Underflow Interrupt Enable */
#define USBFS_HSTPIPIMR_CRCERRE (0x1u << 6) /**< \brief (USBFS_HSTPIPIMR[5]) CRC Error Interrupt Enable */
/* -------- USBFS_HSTPIPIER[5] : (USBFS Offset: 0x5F0) Host Pipe Enable Register (n = 0) -------- */
#define USBFS_HSTPIPIER_RXINES (0x1u << 0) /**< \brief (USBFS_HSTPIPIER[5]) Received IN Data Interrupt Enable */
#define USBFS_HSTPIPIER_TXOUTES (0x1u << 1) /**< \brief (USBFS_HSTPIPIER[5]) Transmitted OUT Data Interrupt Enable */
#define USBFS_HSTPIPIER_TXSTPES (0x1u << 2) /**< \brief (USBFS_HSTPIPIER[5]) Transmitted SETUP Interrupt Enable */
#define USBFS_HSTPIPIER_PERRES (0x1u << 3) /**< \brief (USBFS_HSTPIPIER[5]) Pipe Error Interrupt Enable */
#define USBFS_HSTPIPIER_NAKEDES (0x1u << 4) /**< \brief (USBFS_HSTPIPIER[5]) NAKed Interrupt Enable */
#define USBFS_HSTPIPIER_OVERFIES (0x1u << 5) /**< \brief (USBFS_HSTPIPIER[5]) Overflow Interrupt Enable */
#define USBFS_HSTPIPIER_RXSTALLDES (0x1u << 6) /**< \brief (USBFS_HSTPIPIER[5]) Received STALLed Interrupt Enable */
#define USBFS_HSTPIPIER_SHORTPACKETIES (0x1u << 7) /**< \brief (USBFS_HSTPIPIER[5]) Short Packet Interrupt Enable */
#define USBFS_HSTPIPIER_NBUSYBKES (0x1u << 12) /**< \brief (USBFS_HSTPIPIER[5]) Number of Busy Banks Enable */
#define USBFS_HSTPIPIER_PDISHDMAS (0x1u << 16) /**< \brief (USBFS_HSTPIPIER[5]) Pipe Interrupts Disable HDMA Request Enable */
#define USBFS_HSTPIPIER_PFREEZES (0x1u << 17) /**< \brief (USBFS_HSTPIPIER[5]) Pipe Freeze Enable */
#define USBFS_HSTPIPIER_RSTDTS (0x1u << 18) /**< \brief (USBFS_HSTPIPIER[5]) Reset Data Toggle Enable */
#define USBFS_HSTPIPIER_UNDERFIES (0x1u << 2) /**< \brief (USBFS_HSTPIPIER[5]) Underflow Interrupt Enable */
#define USBFS_HSTPIPIER_CRCERRES (0x1u << 6) /**< \brief (USBFS_HSTPIPIER[5]) CRC Error Interrupt Enable */
/* -------- USBFS_HSTPIPIDR[5] : (USBFS Offset: 0x620) Host Pipe Disable Register (n = 0) -------- */
#define USBFS_HSTPIPIDR_RXINEC (0x1u << 0) /**< \brief (USBFS_HSTPIPIDR[5]) Received IN Data Interrupt Disable */
#define USBFS_HSTPIPIDR_TXOUTEC (0x1u << 1) /**< \brief (USBFS_HSTPIPIDR[5]) Transmitted OUT Data Interrupt Disable */
#define USBFS_HSTPIPIDR_TXSTPEC (0x1u << 2) /**< \brief (USBFS_HSTPIPIDR[5]) Transmitted SETUP Interrupt Disable */
#define USBFS_HSTPIPIDR_PERREC (0x1u << 3) /**< \brief (USBFS_HSTPIPIDR[5]) Pipe Error Interrupt Disable */
#define USBFS_HSTPIPIDR_NAKEDEC (0x1u << 4) /**< \brief (USBFS_HSTPIPIDR[5]) NAKed Interrupt Disable */
#define USBFS_HSTPIPIDR_OVERFIEC (0x1u << 5) /**< \brief (USBFS_HSTPIPIDR[5]) Overflow Interrupt Disable */
#define USBFS_HSTPIPIDR_RXSTALLDEC (0x1u << 6) /**< \brief (USBFS_HSTPIPIDR[5]) Received STALLed Interrupt Disable */
#define USBFS_HSTPIPIDR_SHORTPACKETIEC (0x1u << 7) /**< \brief (USBFS_HSTPIPIDR[5]) Short Packet Interrupt Disable */
#define USBFS_HSTPIPIDR_NBUSYBKEC (0x1u << 12) /**< \brief (USBFS_HSTPIPIDR[5]) Number of Busy Banks Disable */
#define USBFS_HSTPIPIDR_FIFOCONC (0x1u << 14) /**< \brief (USBFS_HSTPIPIDR[5]) FIFO Control Disable */
#define USBFS_HSTPIPIDR_PDISHDMAC (0x1u << 16) /**< \brief (USBFS_HSTPIPIDR[5]) Pipe Interrupts Disable HDMA Request Disable */
#define USBFS_HSTPIPIDR_PFREEZEC (0x1u << 17) /**< \brief (USBFS_HSTPIPIDR[5]) Pipe Freeze Disable */
#define USBFS_HSTPIPIDR_UNDERFIEC (0x1u << 2) /**< \brief (USBFS_HSTPIPIDR[5]) Underflow Interrupt Disable */
#define USBFS_HSTPIPIDR_CRCERREC (0x1u << 6) /**< \brief (USBFS_HSTPIPIDR[5]) CRC Error Interrupt Disable */
/* -------- USBFS_HSTPIPINRQ[5] : (USBFS Offset: 0x650) Host Pipe IN Request Register (n = 0) -------- */
#define USBFS_HSTPIPINRQ_INRQ_Pos 0
#define USBFS_HSTPIPINRQ_INRQ_Msk (0xffu << USBFS_HSTPIPINRQ_INRQ_Pos) /**< \brief (USBFS_HSTPIPINRQ[5]) IN Request Number before Freeze */
#define USBFS_HSTPIPINRQ_INRQ(value) ((USBFS_HSTPIPINRQ_INRQ_Msk & ((value) << USBFS_HSTPIPINRQ_INRQ_Pos)))
#define USBFS_HSTPIPINRQ_INMODE (0x1u << 8) /**< \brief (USBFS_HSTPIPINRQ[5]) IN Request Mode */
/* -------- USBFS_HSTPIPERR[5] : (USBFS Offset: 0x680) Host Pipe Error Register (n = 0) -------- */
#define USBFS_HSTPIPERR_DATATGL (0x1u << 0) /**< \brief (USBFS_HSTPIPERR[5]) Data Toggle Error */
#define USBFS_HSTPIPERR_DATAPID (0x1u << 1) /**< \brief (USBFS_HSTPIPERR[5]) Data PID Error */
#define USBFS_HSTPIPERR_PID (0x1u << 2) /**< \brief (USBFS_HSTPIPERR[5]) Data PID Error */
#define USBFS_HSTPIPERR_TIMEOUT (0x1u << 3) /**< \brief (USBFS_HSTPIPERR[5]) Time-Out Error */
#define USBFS_HSTPIPERR_CRC16 (0x1u << 4) /**< \brief (USBFS_HSTPIPERR[5]) CRC16 Error */
#define USBFS_HSTPIPERR_COUNTER_Pos 5
#define USBFS_HSTPIPERR_COUNTER_Msk (0x3u << USBFS_HSTPIPERR_COUNTER_Pos) /**< \brief (USBFS_HSTPIPERR[5]) Error Counter */
#define USBFS_HSTPIPERR_COUNTER(value) ((USBFS_HSTPIPERR_COUNTER_Msk & ((value) << USBFS_HSTPIPERR_COUNTER_Pos)))
/* -------- USBFS_HSTDMANXTDSC : (USBFS Offset: N/A) Host DMA Channel Next Descriptor Address Register -------- */
#define USBFS_HSTDMANXTDSC_NXT_DSC_ADD_Pos 0
#define USBFS_HSTDMANXTDSC_NXT_DSC_ADD_Msk (0xffffffffu << USBFS_HSTDMANXTDSC_NXT_DSC_ADD_Pos) /**< \brief (USBFS_HSTDMANXTDSC) Next Descriptor Address */
#define USBFS_HSTDMANXTDSC_NXT_DSC_ADD(value) ((USBFS_HSTDMANXTDSC_NXT_DSC_ADD_Msk & ((value) << USBFS_HSTDMANXTDSC_NXT_DSC_ADD_Pos)))
/* -------- USBFS_HSTDMAADDRESS : (USBFS Offset: N/A) Host DMA Channel Address Register -------- */
#define USBFS_HSTDMAADDRESS_BUFF_ADD_Pos 0
#define USBFS_HSTDMAADDRESS_BUFF_ADD_Msk (0xffffffffu << USBFS_HSTDMAADDRESS_BUFF_ADD_Pos) /**< \brief (USBFS_HSTDMAADDRESS) Buffer Address */
#define USBFS_HSTDMAADDRESS_BUFF_ADD(value) ((USBFS_HSTDMAADDRESS_BUFF_ADD_Msk & ((value) << USBFS_HSTDMAADDRESS_BUFF_ADD_Pos)))
/* -------- USBFS_HSTDMACONTROL : (USBFS Offset: N/A) Host DMA Channel Control Register -------- */
#define USBFS_HSTDMACONTROL_CHANN_ENB (0x1u << 0) /**< \brief (USBFS_HSTDMACONTROL) Channel Enable Command */
#define USBFS_HSTDMACONTROL_LDNXT_DSC (0x1u << 1) /**< \brief (USBFS_HSTDMACONTROL) Load Next Channel Transfer Descriptor Enable Command */
#define USBFS_HSTDMACONTROL_END_TR_EN (0x1u << 2) /**< \brief (USBFS_HSTDMACONTROL) End of Transfer Enable Control (OUT transfers only) */
#define USBFS_HSTDMACONTROL_END_B_EN (0x1u << 3) /**< \brief (USBFS_HSTDMACONTROL) End of Buffer Enable Control */
#define USBFS_HSTDMACONTROL_END_TR_IT (0x1u << 4) /**< \brief (USBFS_HSTDMACONTROL) End of Transfer Interrupt Enable */
#define USBFS_HSTDMACONTROL_END_BUFFIT (0x1u << 5) /**< \brief (USBFS_HSTDMACONTROL) End of Buffer Interrupt Enable */
#define USBFS_HSTDMACONTROL_DESC_LD_IT (0x1u << 6) /**< \brief (USBFS_HSTDMACONTROL) Descriptor Loaded Interrupt Enable */
#define USBFS_HSTDMACONTROL_BURST_LCK (0x1u << 7) /**< \brief (USBFS_HSTDMACONTROL) Burst Lock Enable */
#define USBFS_HSTDMACONTROL_BUFF_LENGTH_Pos 16
#define USBFS_HSTDMACONTROL_BUFF_LENGTH_Msk (0xffffu << USBFS_HSTDMACONTROL_BUFF_LENGTH_Pos) /**< \brief (USBFS_HSTDMACONTROL) Buffer Byte Length (Write-only) */
#define USBFS_HSTDMACONTROL_BUFF_LENGTH(value) ((USBFS_HSTDMACONTROL_BUFF_LENGTH_Msk & ((value) << USBFS_HSTDMACONTROL_BUFF_LENGTH_Pos)))
/* -------- USBFS_HSTDMASTATUS : (USBFS Offset: N/A) Host DMA Channel Status Register -------- */
#define USBFS_HSTDMASTATUS_CHANN_ENB (0x1u << 0) /**< \brief (USBFS_HSTDMASTATUS) Channel Enable Status */
#define USBFS_HSTDMASTATUS_CHANN_ACT (0x1u << 1) /**< \brief (USBFS_HSTDMASTATUS) Channel Active Status */
#define USBFS_HSTDMASTATUS_END_TR_ST (0x1u << 4) /**< \brief (USBFS_HSTDMASTATUS) End of Channel Transfer Status */
#define USBFS_HSTDMASTATUS_END_BF_ST (0x1u << 5) /**< \brief (USBFS_HSTDMASTATUS) End of Channel Buffer Status */
#define USBFS_HSTDMASTATUS_DESC_LDST (0x1u << 6) /**< \brief (USBFS_HSTDMASTATUS) Descriptor Loaded Status */
#define USBFS_HSTDMASTATUS_BUFF_COUNT_Pos 16
#define USBFS_HSTDMASTATUS_BUFF_COUNT_Msk (0xffffu << USBFS_HSTDMASTATUS_BUFF_COUNT_Pos) /**< \brief (USBFS_HSTDMASTATUS) Buffer Byte Count */
#define USBFS_HSTDMASTATUS_BUFF_COUNT(value) ((USBFS_HSTDMASTATUS_BUFF_COUNT_Msk & ((value) << USBFS_HSTDMASTATUS_BUFF_COUNT_Pos)))
/* -------- USBFS_CTRL : (USBFS Offset: 0x0800) General Control Register -------- */
#define USBFS_CTRL_RDERRE (0x1u << 4) /**< \brief (USBFS_CTRL) Remote Device Connection Error Interrupt Enable */
#define USBFS_CTRL_FRZCLK (0x1u << 14) /**< \brief (USBFS_CTRL) Freeze USB Clock */
#define USBFS_CTRL_USBE (0x1u << 15) /**< \brief (USBFS_CTRL) USBFS Enable */
#define USBFS_CTRL_UIMOD (0x1u << 25) /**< \brief (USBFS_CTRL) USBFS Mode */
#define   USBFS_CTRL_UIMOD_HOST (0x0u << 25) /**< \brief (USBFS_CTRL) The module is in USB Host mode. */
#define   USBFS_CTRL_UIMOD_DEVICE (0x1u << 25) /**< \brief (USBFS_CTRL) The module is in USB Device mode. */
/* -------- USBFS_SR : (USBFS Offset: 0x0804) General Status Register -------- */
#define USBFS_SR_RDERRI (0x1u << 4) /**< \brief (USBFS_SR) Remote Device Connection Error Interrupt (Host mode only) */
#define USBFS_SR_VBUSRQ (0x1u << 9) /**< \brief (USBFS_SR) VBus Request (Host mode only) */
/* -------- USBFS_SCR : (USBFS Offset: 0x0808) General Status Clear Register -------- */
#define USBFS_SCR_RDERRIC (0x1u << 4) /**< \brief (USBFS_SCR) Remote Device Connection Error Interrupt Clear */
#define USBFS_SCR_VBUSRQC (0x1u << 9) /**< \brief (USBFS_SCR) VBus Request Clear */
/* -------- USBFS_SFR : (USBFS Offset: 0x080C) General Status Set Register -------- */
#define USBFS_SFR_RDERRIS (0x1u << 4) /**< \brief (USBFS_SFR) Remote Device Connection Error Interrupt Set */
#define USBFS_SFR_VBUSRQS (0x1u << 9) /**< \brief (USBFS_SFR) VBus Request Set */

/*@}*/


#endif /* _SAM4C_USBFS_COMPONENT_ */
